#pragma once
#include "common.h"
namespace SDK
{


    struct FBlueprintSessionResult //ScriptStruct OnlineSubsystemUtils.BlueprintSessionResult
    {
    public:


    };

    struct FDefault__ScriptStruct //ScriptStruct CoreUObject.Default__ScriptStruct
    {
    public:


    };

    struct FInAppPurchaseProductInfo //ScriptStruct OnlineSubsystem.InAppPurchaseProductInfo
    {
    //Children Prop Count (Fields): 11
    public:

        struct FString Identifier; // 0x0
        struct FString TransactionIdentifier; // 0x10
        struct FString DisplayName; // 0x20
        struct FString DisplayDescription; // 0x30
        struct FString DisplayPrice; // 0x40
        float RawPrice; // 0x50
        struct FString CurrencyCode; // 0x58
        struct FString CurrencySymbol; // 0x68
        struct FString DecimalSeparator; // 0x78
        struct FString GroupingSeparator; // 0x88
        struct FString ReceiptData; // 0x98

    };

    struct FInAppPurchaseReceiptInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseReceiptInfo2
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemId; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FOnlineProxyStoreOffer //ScriptStruct OnlineSubsystemUtils.OnlineProxyStoreOffer
    {
    //Children Prop Count (Fields): 13
    public:

        struct FString OfferId; // 0x0
        struct FText Title; // 0x10
        struct FText Description; // 0x30
        struct FText LongDescription; // 0x50
        struct FText RegularPriceText; // 0x70
        int32_t RegularPrice; // 0x90
        struct FText PriceText; // 0x98
        int32_t NumericPrice; // 0xb8
        struct FString CurrencyCode; // 0xc0
        struct FDateTime ReleaseDate; // 0xd0
        struct FDateTime ExpirationDate; // 0xd8
        enum class EOnlineProxyStoreOfferDiscountType DiscountType; // 0xe0
        struct TMap<struct FString, struct FString> DynamicFields; // 0xe8

    };

    struct FJoinabilitySettings //ScriptStruct CoreUObject.JoinabilitySettings
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName SessionName; // 0x0
        bool bPublicSearchable; // 0x8
        bool bAllowInvites; // 0x9
        bool bJoinViaPresence; // 0xa
        bool bJoinViaPresenceFriendsOnly; // 0xb
        int32_t MaxPlayers; // 0xc
        int32_t MaxPartySize; // 0x10

    };

    struct FUniqueNetIdWrapper //ScriptStruct CoreUObject.UniqueNetIdWrapper
    {
    public:


    };

    struct FGuid //ScriptStruct CoreUObject.Guid
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t A; // 0x0
        int32_t B; // 0x4
        int32_t C; // 0x8
        int32_t D; // 0xc

    };

    struct FVector //ScriptStruct CoreUObject.Vector
    {
    //Children Prop Count (Fields): 3
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8

    };

    struct FVector4 //ScriptStruct CoreUObject.Vector4
    {
    //Children Prop Count (Fields): 4
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8
        float W; // 0xc

    };

    struct FVector2D //ScriptStruct CoreUObject.Vector2D
    {
    //Children Prop Count (Fields): 2
    public:

        float X; // 0x0
        float Y; // 0x4

    };

    struct FTwoVectors //ScriptStruct CoreUObject.TwoVectors
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector v1; // 0x0
        struct FVector v2; // 0xc

    };

    struct FPlane : FVector //ScriptStruct CoreUObject.Plane
    {
    //Children Prop Count (Fields): 1
    public:

        float W; // 0xc

    };

    struct FRotator //ScriptStruct CoreUObject.Rotator
    {
    //Children Prop Count (Fields): 3
    public:

        float Pitch; // 0x0
        float Yaw; // 0x4
        float Roll; // 0x8

    };

    struct FQuat //ScriptStruct CoreUObject.Quat
    {
    //Children Prop Count (Fields): 4
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8
        float W; // 0xc

    };

    struct FPackedNormal //ScriptStruct CoreUObject.PackedNormal
    {
    //Children Prop Count (Fields): 4
    public:

        char X; // 0x0
        char Y; // 0x1
        char Z; // 0x2
        char W; // 0x3

    };

    struct FPackedRGB10A2N //ScriptStruct CoreUObject.PackedRGB10A2N
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Packed; // 0x0

    };

    struct FPackedRGBA16N //ScriptStruct CoreUObject.PackedRGBA16N
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t XY; // 0x0
        int32_t ZW; // 0x4

    };

    struct FIntPoint //ScriptStruct CoreUObject.IntPoint
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t X; // 0x0
        int32_t Y; // 0x4

    };

    struct FIntVector //ScriptStruct CoreUObject.IntVector
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t X; // 0x0
        int32_t Y; // 0x4
        int32_t Z; // 0x8

    };

    struct FColor //ScriptStruct CoreUObject.Color
    {
    //Children Prop Count (Fields): 4
    public:

        char B; // 0x0
        char G; // 0x1
        char R; // 0x2
        char A; // 0x3

    };

    struct FLinearColor //ScriptStruct CoreUObject.LinearColor
    {
    //Children Prop Count (Fields): 4
    public:

        float R; // 0x0
        float G; // 0x4
        float B; // 0x8
        float A; // 0xc

    };

    struct FBox //ScriptStruct CoreUObject.Box
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Min; // 0x0
        struct FVector Max; // 0xc
        char IsValid; // 0x18

    };

    struct FBox2D //ScriptStruct CoreUObject.Box2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector2D Min; // 0x0
        struct FVector2D Max; // 0x8
        char bIsValid; // 0x10

    };

    struct FBoxSphereBounds //ScriptStruct CoreUObject.BoxSphereBounds
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Origin; // 0x0
        struct FVector BoxExtent; // 0xc
        float SphereRadius; // 0x18

    };

    struct FOrientedBox //ScriptStruct CoreUObject.OrientedBox
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector Center; // 0x0
        struct FVector AxisX; // 0xc
        struct FVector AxisY; // 0x18
        struct FVector AxisZ; // 0x24
        float ExtentX; // 0x30
        float ExtentY; // 0x34
        float ExtentZ; // 0x38

    };

    struct FMatrix //ScriptStruct CoreUObject.Matrix
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPlane XPlane; // 0x0
        struct FPlane YPlane; // 0x10
        struct FPlane ZPlane; // 0x20
        struct FPlane WPlane; // 0x30

    };

    struct FInterpCurvePointFloat //ScriptStruct CoreUObject.InterpCurvePointFloat
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        float OutVal; // 0x4
        float ArriveTangent; // 0x8
        float LeaveTangent; // 0xc
        enum class EInterpCurveMode InterpMode; // 0x10

    };

    struct FInterpCurveFloat //ScriptStruct CoreUObject.InterpCurveFloat
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointFloat> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointVector2D //ScriptStruct CoreUObject.InterpCurvePointVector2D
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FVector2D OutVal; // 0x4
        struct FVector2D ArriveTangent; // 0xc
        struct FVector2D LeaveTangent; // 0x14
        enum class EInterpCurveMode InterpMode; // 0x1c

    };

    struct FInterpCurveVector2D //ScriptStruct CoreUObject.InterpCurveVector2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointVector2D> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointVector //ScriptStruct CoreUObject.InterpCurvePointVector
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FVector OutVal; // 0x4
        struct FVector ArriveTangent; // 0x10
        struct FVector LeaveTangent; // 0x1c
        enum class EInterpCurveMode InterpMode; // 0x28

    };

    struct FInterpCurveVector //ScriptStruct CoreUObject.InterpCurveVector
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointVector> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointQuat //ScriptStruct CoreUObject.InterpCurvePointQuat
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FQuat OutVal; // 0x10
        struct FQuat ArriveTangent; // 0x20
        struct FQuat LeaveTangent; // 0x30
        enum class EInterpCurveMode InterpMode; // 0x40

    };

    struct FInterpCurveQuat //ScriptStruct CoreUObject.InterpCurveQuat
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointQuat> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointTwoVectors //ScriptStruct CoreUObject.InterpCurvePointTwoVectors
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FTwoVectors OutVal; // 0x4
        struct FTwoVectors ArriveTangent; // 0x1c
        struct FTwoVectors LeaveTangent; // 0x34
        enum class EInterpCurveMode InterpMode; // 0x4c

    };

    struct FInterpCurveTwoVectors //ScriptStruct CoreUObject.InterpCurveTwoVectors
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointTwoVectors> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointLinearColor //ScriptStruct CoreUObject.InterpCurvePointLinearColor
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FLinearColor OutVal; // 0x4
        struct FLinearColor ArriveTangent; // 0x14
        struct FLinearColor LeaveTangent; // 0x24
        enum class EInterpCurveMode InterpMode; // 0x34

    };

    struct FInterpCurveLinearColor //ScriptStruct CoreUObject.InterpCurveLinearColor
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointLinearColor> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FTransform //ScriptStruct CoreUObject.Transform
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Rotation; // 0x0
        struct FVector Translation; // 0x10
        struct FVector Scale3D; // 0x20

    };

    struct FRandomStream //ScriptStruct CoreUObject.RandomStream
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t InitialSeed; // 0x0
        int32_t Seed; // 0x4

    };

    struct FDateTime //ScriptStruct CoreUObject.DateTime
    {
    public:


    };

    struct FFrameNumber //ScriptStruct CoreUObject.FrameNumber
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Value; // 0x0

    };

    struct FFrameRate //ScriptStruct CoreUObject.FrameRate
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Numerator; // 0x0
        int32_t Denominator; // 0x4

    };

    struct FFrameTime //ScriptStruct CoreUObject.FrameTime
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber FrameNumber; // 0x0
        float SubFrame; // 0x4

    };

    struct FQualifiedFrameTime //ScriptStruct CoreUObject.QualifiedFrameTime
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameTime Time; // 0x0
        struct FFrameRate Rate; // 0x8

    };

    struct FTimecode //ScriptStruct CoreUObject.Timecode
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t Hours; // 0x0
        int32_t Minutes; // 0x4
        int32_t Seconds; // 0x8
        int32_t Frames; // 0xc
        bool bDropFrameFormat; // 0x10

    };

    struct FTimespan //ScriptStruct CoreUObject.Timespan
    {
    public:


    };

    struct FSoftObjectPath //ScriptStruct CoreUObject.SoftObjectPath
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName AssetPathName; // 0x0
        struct FString SubPathString; // 0x8

    };

    struct FSoftClassPath : FSoftObjectPath //ScriptStruct CoreUObject.SoftClassPath
    {
    public:


    };

    struct FPrimaryAssetType //ScriptStruct CoreUObject.PrimaryAssetType
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FPrimaryAssetId //ScriptStruct CoreUObject.PrimaryAssetId
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPrimaryAssetType PrimaryAssetType; // 0x0
        struct FName PrimaryAssetName; // 0x8

    };

    struct FFallbackStruct //ScriptStruct CoreUObject.FallbackStruct
    {
    public:


    };

    struct FFloatRangeBound //ScriptStruct CoreUObject.FloatRangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        float Value; // 0x4

    };

    struct FFloatRange //ScriptStruct CoreUObject.FloatRange
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFloatRangeBound LowerBound; // 0x0
        struct FFloatRangeBound UpperBound; // 0x8

    };

    struct FInt32RangeBound //ScriptStruct CoreUObject.Int32RangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        int32_t Value; // 0x4

    };

    struct FInt32Range //ScriptStruct CoreUObject.Int32Range
    {
    //Children Prop Count (Fields): 2
    public:

        struct FInt32RangeBound LowerBound; // 0x0
        struct FInt32RangeBound UpperBound; // 0x8

    };

    struct FFrameNumberRangeBound //ScriptStruct CoreUObject.FrameNumberRangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        struct FFrameNumber Value; // 0x4

    };

    struct FFrameNumberRange //ScriptStruct CoreUObject.FrameNumberRange
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumberRangeBound LowerBound; // 0x0
        struct FFrameNumberRangeBound UpperBound; // 0x8

    };

    struct FFloatInterval //ScriptStruct CoreUObject.FloatInterval
    {
    //Children Prop Count (Fields): 2
    public:

        float Min; // 0x0
        float Max; // 0x4

    };

    struct FInt32Interval //ScriptStruct CoreUObject.Int32Interval
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Min; // 0x0
        int32_t Max; // 0x4

    };

    struct FPolyglotTextData //ScriptStruct CoreUObject.PolyglotTextData
    {
    //Children Prop Count (Fields): 8
    public:

        enum class ELocalizedTextSourceCategory Category; // 0x0
        struct FString NativeCulture; // 0x8
        struct FString Namespace; // 0x18
        struct FString Key; // 0x28
        struct FString NativeString; // 0x38
        struct TMap<struct FString, struct FString> LocalizedStrings; // 0x48
        bool bIsMinimalPatch; // 0x98
        struct FText CachedText; // 0xa0

    };

    struct FAutomationEvent //ScriptStruct CoreUObject.AutomationEvent
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EAutomationEventType Type; // 0x0
        struct FString Message; // 0x8
        struct FString Context; // 0x18
        struct FGuid Artifact; // 0x28

    };

    struct FAutomationExecutionEntry //ScriptStruct CoreUObject.AutomationExecutionEntry
    {
    //Children Prop Count (Fields): 4
    public:

        struct FAutomationEvent Event; // 0x0
        struct FString Filename; // 0x38
        int32_t LineNumber; // 0x48
        struct FDateTime Timestamp; // 0x50

    };

    struct FARFilter //ScriptStruct CoreUObject.ARFilter
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<struct FName> PackageNames; // 0x0
        struct TArray<struct FName> PackagePaths; // 0x10
        struct TArray<struct FName> ObjectPaths; // 0x20
        struct TArray<struct FName> ClassNames; // 0x30
        struct TSet<struct FName> RecursiveClassesExclusionSet; // 0x90
        bool bRecursivePaths; // 0xe0
        bool bRecursiveClasses; // 0xe1
        bool bIncludeOnlyOnDiskAssets; // 0xe2

    };

    struct FAssetBundleEntry //ScriptStruct CoreUObject.AssetBundleEntry
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName BundleName; // 0x0
        struct TArray<struct FSoftObjectPath> BundleAssets; // 0x8

    };

    struct FAssetBundleData //ScriptStruct CoreUObject.AssetBundleData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FAssetBundleEntry> Bundles; // 0x0

    };

    struct FAssetData //ScriptStruct CoreUObject.AssetData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName ObjectPath; // 0x0
        struct FName PackageName; // 0x8
        struct FName PackagePath; // 0x10
        struct FName AssetName; // 0x18
        struct FName AssetClass; // 0x20

    };

    struct FTestUninitializedScriptStructMembersTest //ScriptStruct CoreUObject.TestUninitializedScriptStructMembersTest
    {
    //Children Prop Count (Fields): 3
    public:

        class UObject* UninitializedObjectReference; // 0x0
        class UObject* InitializedObjectReference; // 0x8
        float UnusedValue; // 0x10

    };

    struct FInAppPurchaseRestoreInfo //ScriptStruct OnlineSubsystem.InAppPurchaseRestoreInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Identifier; // 0x0
        struct FString ReceiptData; // 0x10
        struct FString TransactionIdentifier; // 0x20

    };

    struct FInAppPurchaseRestoreInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseRestoreInfo2
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemId; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FYPlayfabMessage //ScriptStruct BackendModels.YPlayfabMessage
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString m_userId; // 0x0
        struct FString m_service; // 0x10
        class UScriptStruct* m_desiredStruct; // 0x20
        struct FString m_jsonData; // 0x28
        int32_t m_requestHandle; // 0x38

    };

    struct FPlayFabBaseModel //ScriptStruct PlayFab.PlayFabBaseModel
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPlayFabError responseError; // 0x0
        class UPlayFabJsonObject* responseData; // 0x38

    };

    struct FPlayFabError //ScriptStruct PlayFab.PlayFabError
    {
    //Children Prop Count (Fields): 5
    public:

        bool HasError; // 0x0
        int32_t ErrorCode; // 0x4
        struct FString ErrorName; // 0x8
        struct FString errorMessage; // 0x18
        struct FString ErrorDetails; // 0x28

    };

    struct FDistributionLookupTable //ScriptStruct Engine.DistributionLookupTable
    {
    //Children Prop Count (Fields): 8
    public:

        float TimeScale; // 0x0
        float TimeBias; // 0x4
        struct TArray<float> Values; // 0x8
        char Op; // 0x18
        char EntryCount; // 0x19
        char EntryStride; // 0x1a
        char SubEntryStride; // 0x1b
        char LockFlag; // 0x1c

    };

    struct FRawDistribution //ScriptStruct Engine.RawDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FFloatDistribution //ScriptStruct Engine.FloatDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FVectorDistribution //ScriptStruct Engine.VectorDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FVector4Distribution //ScriptStruct Engine.Vector4Distribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FFloatRK4SpringInterpolator //ScriptStruct Engine.FloatRK4SpringInterpolator
    {
    //Children Prop Count (Fields): 2
    public:

        float StiffnessConstant; // 0x0
        float DampeningRatio; // 0x4

    };

    struct FVectorRK4SpringInterpolator //ScriptStruct Engine.VectorRK4SpringInterpolator
    {
    //Children Prop Count (Fields): 2
    public:

        float StiffnessConstant; // 0x0
        float DampeningRatio; // 0x4

    };

    struct FFormatArgumentData //ScriptStruct Engine.FormatArgumentData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString ArgumentName; // 0x0
        enum class EFormatArgumentType ArgumentValueType; // 0x10
        struct FText ArgumentValue; // 0x18
        int32_t ArgumentValueInt; // 0x38
        float ArgumentValueFloat; // 0x3c
        enum class ETextGender ArgumentValueGender; // 0x40

    };

    struct FExpressionInput //ScriptStruct Engine.ExpressionInput
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t OutputIndex; // 0x0
        struct FName InputName; // 0x4
        struct FName ExpressionName; // 0xc

    };

    struct FMaterialAttributesInput : FExpressionInput //ScriptStruct Engine.MaterialAttributesInput
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t PropertyConnectedBitmask; // 0x14

    };

    struct FExpressionOutput //ScriptStruct Engine.ExpressionOutput
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName OutputName; // 0x0

    };

    struct FMaterialInput //ScriptStruct Engine.MaterialInput
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t OutputIndex; // 0x0
        struct FName InputName; // 0x4
        struct FName ExpressionName; // 0xc

    };

    struct FColorMaterialInput : FMaterialInput //ScriptStruct Engine.ColorMaterialInput
    {
    public:


    };

    struct FScalarMaterialInput : FMaterialInput //ScriptStruct Engine.ScalarMaterialInput
    {
    public:


    };

    struct FShadingModelMaterialInput : FMaterialInput //ScriptStruct Engine.ShadingModelMaterialInput
    {
    public:


    };

    struct FVectorMaterialInput : FMaterialInput //ScriptStruct Engine.VectorMaterialInput
    {
    public:


    };

    struct FVector2MaterialInput : FMaterialInput //ScriptStruct Engine.Vector2MaterialInput
    {
    public:


    };

    struct FHitResult //ScriptStruct Engine.HitResult
    {
    //Children Prop Count (Fields): 19
    public:

        int32_t FaceIndex; // 0x0
        float Time; // 0x4
        float Distance; // 0x8
        struct FVector_NetQuantize Location; // 0xc
        struct FVector_NetQuantize ImpactPoint; // 0x18
        struct FVector_NetQuantizeNormal Normal; // 0x24
        struct FVector_NetQuantizeNormal ImpactNormal; // 0x30
        struct FVector_NetQuantize TraceStart; // 0x3c
        struct FVector_NetQuantize TraceEnd; // 0x48
        float PenetrationDepth; // 0x54
        int32_t Item; // 0x58
        char ElementIndex; // 0x5c
        char bBlockingHit; // 0x5d
        char bStartPenetrating; // 0x5d
        struct TWeakObjectPtr<struct UPhysicalMaterial> PhysMaterial; // 0x60
        struct TWeakObjectPtr<struct AActor> Actor; // 0x68
        struct TWeakObjectPtr<struct UPrimitiveComponent> Component; // 0x70
        struct FName BoneName; // 0x78
        struct FName MyBoneName; // 0x80

    };

    struct FVector_NetQuantize : FVector //ScriptStruct Engine.Vector_NetQuantize
    {
    public:


    };

    struct FVector_NetQuantizeNormal : FVector //ScriptStruct Engine.Vector_NetQuantizeNormal
    {
    public:


    };

    struct FKey //ScriptStruct InputCore.Key
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName KeyName; // 0x0

    };

    struct FBranchingPointNotifyPayload //ScriptStruct Engine.BranchingPointNotifyPayload
    {
    public:


    };

    struct FSimpleMemberReference //ScriptStruct Engine.SimpleMemberReference
    {
    //Children Prop Count (Fields): 3
    public:

        class UObject* MemberParent; // 0x0
        struct FName MemberName; // 0x8
        struct FGuid MemberGuid; // 0x10

    };

    struct FTickFunction //ScriptStruct Engine.TickFunction
    {
    //Children Prop Count (Fields): 7
    public:

        enum class ETickingGroup TickGroup; // 0x8
        enum class ETickingGroup EndTickGroup; // 0x9
        char bTickEvenWhenPaused; // 0xa
        char bCanEverTick; // 0xa
        char bStartWithTickEnabled; // 0xa
        char bAllowTickOnDedicatedServer; // 0xa
        float TickInterval; // 0xc

    };

    struct FActorComponentTickFunction : FTickFunction //ScriptStruct Engine.ActorComponentTickFunction
    {
    public:


    };

    struct FSubtitleCue //ScriptStruct Engine.SubtitleCue
    {
    //Children Prop Count (Fields): 2
    public:

        struct FText Text; // 0x0
        float Time; // 0x20

    };

    struct FInterpControlPoint //ScriptStruct Engine.InterpControlPoint
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector PositionControlPoint; // 0x0
        bool bPositionIsRelative; // 0xc

    };

    struct FPlatformInterfaceDelegateResult //ScriptStruct Engine.PlatformInterfaceDelegateResult
    {
    //Children Prop Count (Fields): 2
    public:

        bool bSuccessful; // 0x0
        struct FPlatformInterfaceData Data; // 0x8

    };

    struct FPlatformInterfaceData //ScriptStruct Engine.PlatformInterfaceData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName DataName; // 0x0
        enum class EPlatformInterfaceDataType Type; // 0x8
        int32_t IntValue; // 0xc
        float FloatValue; // 0x10
        struct FString StringValue; // 0x18
        class UObject* ObjectValue; // 0x28

    };

    struct FRepAttachment //ScriptStruct Engine.RepAttachment
    {
    //Children Prop Count (Fields): 6
    public:

        class AActor* AttachParent; // 0x0
        struct FVector_NetQuantize100 LocationOffset; // 0x8
        struct FVector_NetQuantize100 RelativeScale3D; // 0x14
        struct FRotator RotationOffset; // 0x20
        struct FName AttachSocket; // 0x2c
        class USceneComponent* AttachComponent; // 0x38

    };

    struct FVector_NetQuantize100 : FVector //ScriptStruct Engine.Vector_NetQuantize100
    {
    public:


    };

    struct FRepMovement //ScriptStruct Engine.RepMovement
    {
    //Children Prop Count (Fields): 11
    public:

        struct FVector LinearVelocity; // 0x0
        struct FVector AngularVelocity; // 0xc
        struct FVector Location; // 0x18
        struct FRotator Rotation; // 0x24
        char bSimulatedPhysicSleep; // 0x30
        char bRepPhysics; // 0x30
        char m_repAngularYawMovement; // 0x31
        float m_angularYawRotation; // 0x34
        enum class EVectorQuantization LocationQuantizationLevel; // 0x38
        enum class EVectorQuantization VelocityQuantizationLevel; // 0x39
        enum class ERotatorQuantization RotationQuantizationLevel; // 0x3a

    };

    struct FActorTickFunction : FTickFunction //ScriptStruct Engine.ActorTickFunction
    {
    public:


    };

    struct FUniqueNetIdRepl : FUniqueNetIdWrapper //ScriptStruct Engine.UniqueNetIdRepl
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> ReplicationBytes; // 0x18

    };

    struct FDebugFloatHistory //ScriptStruct Engine.DebugFloatHistory
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<float> Samples; // 0x0
        float MaxSamples; // 0x10
        float MinValue; // 0x14
        float MaxValue; // 0x18
        bool bAutoAdjustMinMax; // 0x1c

    };

    struct FLatentActionInfo //ScriptStruct Engine.LatentActionInfo
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Linkage; // 0x0
        int32_t UUID; // 0x4
        struct FName ExecutionFunction; // 0x8
        class UObject* CallbackTarget; // 0x10

    };

    struct FTimerHandle //ScriptStruct Engine.TimerHandle
    {
    //Children Prop Count (Fields): 1
    public:

        uint64_t Handle; // 0x0

    };

    struct FCollisionProfileName //ScriptStruct Engine.CollisionProfileName
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FGenericStruct //ScriptStruct Engine.GenericStruct
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Data; // 0x0

    };

    struct FUserActivity //ScriptStruct Engine.UserActivity
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ActionName; // 0x0

    };

    struct FPlayFabResultCommon //ScriptStruct PlayFab.PlayFabResultCommon
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Request; // 0x0

    };

    struct FAdminEmptyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AdminEmptyResponse
    {
    public:


    };

    struct FPlayFabRequestCommon //ScriptStruct PlayFab.PlayFabRequestCommon
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabAuthenticationContext* AuthenticationContext; // 0x0

    };

    struct FAdminAbortTaskInstanceRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAbortTaskInstanceRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString TaskInstanceId; // 0x10

    };

    struct FAdminAddLocalizedNewsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminAddLocalizedNewsResult
    {
    public:


    };

    struct FAdminAddLocalizedNewsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAddLocalizedNewsRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString Body; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Language; // 0x20
        struct FString NewsId; // 0x30
        struct FString Title; // 0x40

    };

    struct FAdminAddNewsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminAddNewsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString NewsId; // 0x8

    };

    struct FAdminAddNewsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAddNewsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString Body; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Timestamp; // 0x20
        struct FString Title; // 0x30

    };

    struct FAdminAddPlayerTagResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminAddPlayerTagResult
    {
    public:


    };

    struct FAdminAddPlayerTagRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAddPlayerTagRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString TagName; // 0x20

    };

    struct FAdminAddServerBuildResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminAddServerBuildResult
    {
    //Children Prop Count (Fields): 10
    public:

        struct FString ActiveRegions; // 0x8
        struct FString BuildId; // 0x18
        struct FString CommandLineTemplate; // 0x28
        struct FString Comment; // 0x38
        struct FString ExecutablePath; // 0x48
        int32_t MaxGamesPerHost; // 0x58
        int32_t MinFreeGameSlots; // 0x5c
        enum class EGameBuildStatus Status; // 0x60
        struct FString Timestamp; // 0x68
        struct FString TitleId; // 0x78

    };

    struct FAdminAddServerBuildRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAddServerBuildRequest
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString ActiveRegions; // 0x8
        struct FString BuildId; // 0x18
        struct FString CommandLineTemplate; // 0x28
        struct FString Comment; // 0x38
        class UPlayFabJsonObject* CustomTags; // 0x48
        struct FString ExecutablePath; // 0x50
        int32_t MaxGamesPerHost; // 0x60
        int32_t MinFreeGameSlots; // 0x64

    };

    struct FAdminModifyUserVirtualCurrencyResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminModifyUserVirtualCurrencyResult
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Balance; // 0x8
        int32_t BalanceChange; // 0xc
        struct FString PlayFabId; // 0x10
        struct FString VirtualCurrency; // 0x20

    };

    struct FAdminAddUserVirtualCurrencyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAddUserVirtualCurrencyRequest
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Amount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString PlayFabId; // 0x18
        struct FString VirtualCurrency; // 0x28

    };

    struct FAdminBlankResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminBlankResult
    {
    public:


    };

    struct FAdminAddVirtualCurrencyTypesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminAddVirtualCurrencyTypesRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> VirtualCurrencies; // 0x8

    };

    struct FAdminBanUsersResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminBanUsersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FAdminBanUsersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminBanUsersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<class UPlayFabJsonObject*> Bans; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FAdminCheckLimitedEditionItemAvailabilityResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminCheckLimitedEditionItemAvailabilityResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Amount; // 0x8

    };

    struct FAdminCheckLimitedEditionItemAvailabilityRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCheckLimitedEditionItemAvailabilityRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CatalogVersion; // 0x8
        struct FString ItemId; // 0x18

    };

    struct FAdminCreateTaskResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminCreateTaskResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TaskId; // 0x8

    };

    struct FAdminCreateActionsOnPlayerSegmentTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCreateActionsOnPlayerSegmentTaskRequest
    {
    //Children Prop Count (Fields): 6
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Description; // 0x10
        bool IsActive; // 0x20
        struct FString Name; // 0x28
        class UPlayFabJsonObject* Parameter; // 0x38
        struct FString Schedule; // 0x40

    };

    struct FAdminCreateCloudScriptTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCreateCloudScriptTaskRequest
    {
    //Children Prop Count (Fields): 6
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Description; // 0x10
        bool IsActive; // 0x20
        struct FString Name; // 0x28
        class UPlayFabJsonObject* Parameter; // 0x38
        struct FString Schedule; // 0x40

    };

    struct FAdminCreateInsightsScheduledScalingTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCreateInsightsScheduledScalingTaskRequest
    {
    //Children Prop Count (Fields): 6
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Description; // 0x10
        bool IsActive; // 0x20
        struct FString Name; // 0x28
        class UPlayFabJsonObject* Parameter; // 0x38
        struct FString Schedule; // 0x40

    };

    struct FAdminCreateOpenIdConnectionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCreateOpenIdConnectionRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString ClientId; // 0x8
        struct FString ClientSecret; // 0x18
        struct FString ConnectionId; // 0x28
        struct FString IssuerDiscoveryUrl; // 0x38
        class UPlayFabJsonObject* IssuerInformation; // 0x48

    };

    struct FAdminCreatePlayerSharedSecretResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminCreatePlayerSharedSecretResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SecretKey; // 0x8

    };

    struct FAdminCreatePlayerSharedSecretRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCreatePlayerSharedSecretRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FriendlyName; // 0x8

    };

    struct FAdminCreatePlayerStatisticDefinitionResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminCreatePlayerStatisticDefinitionResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Statistic; // 0x8

    };

    struct FAdminCreatePlayerStatisticDefinitionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminCreatePlayerStatisticDefinitionRequest
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EStatisticAggregationMethod AggregationMethod; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString StatisticName; // 0x18
        enum class EStatisticResetIntervalOption VersionChangeInterval; // 0x28

    };

    struct FAdminDeleteMasterPlayerAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminDeleteMasterPlayerAccountResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString JobReceiptId; // 0x8
        struct FString TitleIds; // 0x18

    };

    struct FAdminDeletePlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminDeletePlayerResult
    {
    public:


    };

    struct FAdminDeletePlayerSharedSecretResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminDeletePlayerSharedSecretResult
    {
    public:


    };

    struct FAdminDeleteStoreResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminDeleteStoreResult
    {
    public:


    };

    struct FAdminDeleteTitleResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminDeleteTitleResult
    {
    public:


    };

    struct FAdminDeleteTitleDataOverrideResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminDeleteTitleDataOverrideResult
    {
    public:


    };

    struct FAdminExportMasterPlayerDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminExportMasterPlayerDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString JobReceiptId; // 0x8

    };

    struct FAdminGetActionsOnPlayersInSegmentTaskInstanceResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetActionsOnPlayersInSegmentTaskInstanceResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Parameter; // 0x8
        class UPlayFabJsonObject* Summary; // 0x10

    };

    struct FAdminGetAllSegmentsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetAllSegmentsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Segments; // 0x8

    };

    struct FAdminGetCatalogItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetCatalogItemsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Catalog; // 0x8

    };

    struct FAdminGetCloudScriptRevisionResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetCloudScriptRevisionResult
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CreatedAt; // 0x8
        struct TArray<class UPlayFabJsonObject*> Files; // 0x18
        bool IsPublished; // 0x28
        int32_t Revision; // 0x2c
        int32_t Version; // 0x30

    };

    struct FAdminGetCloudScriptTaskInstanceResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetCloudScriptTaskInstanceResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Parameter; // 0x8
        class UPlayFabJsonObject* Summary; // 0x10

    };

    struct FAdminGetCloudScriptVersionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetCloudScriptVersionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Versions; // 0x8

    };

    struct FAdminGetContentListResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetContentListResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Contents; // 0x8
        int32_t ItemCount; // 0x18
        int32_t TotalSize; // 0x1c

    };

    struct FAdminGetContentUploadUrlResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetContentUploadUrlResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString URL; // 0x8

    };

    struct FAdminGetDataReportResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetDataReportResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString DownloadUrl; // 0x8

    };

    struct FAdminGetMatchmakerGameInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetMatchmakerGameInfoResult
    {
    //Children Prop Count (Fields): 12
    public:

        struct FString BuildVersion; // 0x8
        struct FString EndTime; // 0x18
        struct FString LobbyId; // 0x28
        struct FString Mode; // 0x38
        struct FString Players; // 0x48
        enum class ERegion Region; // 0x58
        struct FString ServerIPV4Address; // 0x60
        struct FString ServerIPV6Address; // 0x70
        int32_t ServerPort; // 0x80
        struct FString ServerPublicDNSName; // 0x88
        struct FString StartTime; // 0x98
        struct FString TitleId; // 0xa8

    };

    struct FAdminGetMatchmakerGameModesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetMatchmakerGameModesResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> GameModes; // 0x8

    };

    struct FAdminGetPlayedTitleListResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayedTitleListResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TitleIds; // 0x8

    };

    struct FAdminGetPlayerIdFromAuthTokenResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerIdFromAuthTokenResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FAdminGetPlayerProfileResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerProfileResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* PlayerProfile; // 0x8

    };

    struct FAdminGetPlayerSegmentsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerSegmentsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Segments; // 0x8

    };

    struct FAdminGetPlayerSharedSecretsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerSharedSecretsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> SharedSecrets; // 0x8

    };

    struct FAdminGetPlayersInSegmentResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayersInSegmentResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ContinuationToken; // 0x8
        struct TArray<class UPlayFabJsonObject*> PlayerProfiles; // 0x18
        int32_t ProfilesInSegment; // 0x28

    };

    struct FAdminGetPlayerStatisticDefinitionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerStatisticDefinitionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Statistics; // 0x8

    };

    struct FAdminGetPlayerStatisticVersionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerStatisticVersionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> StatisticVersions; // 0x8

    };

    struct FAdminGetPlayerTagsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPlayerTagsResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabId; // 0x8
        struct FString Tags; // 0x18

    };

    struct FAdminGetPolicyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPolicyResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PolicyName; // 0x8
        struct TArray<class UPlayFabJsonObject*> Statements; // 0x18

    };

    struct FAdminGetPublisherDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetPublisherDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Data; // 0x8

    };

    struct FAdminGetRandomResultTablesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetRandomResultTablesResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Tables; // 0x8

    };

    struct FAdminGetServerBuildInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetServerBuildInfoResult
    {
    //Children Prop Count (Fields): 9
    public:

        struct FString ActiveRegions; // 0x8
        struct FString BuildId; // 0x18
        struct FString Comment; // 0x28
        struct FString errorMessage; // 0x38
        int32_t MaxGamesPerHost; // 0x48
        int32_t MinFreeGameSlots; // 0x4c
        enum class EGameBuildStatus Status; // 0x50
        struct FString Timestamp; // 0x58
        struct FString TitleId; // 0x68

    };

    struct FAdminGetServerBuildUploadURLResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetServerBuildUploadURLResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString URL; // 0x8

    };

    struct FAdminGetStoreItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetStoreItemsResult
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* MarketingData; // 0x18
        enum class EPfSourceType Source; // 0x20
        struct TArray<class UPlayFabJsonObject*> Store; // 0x28
        struct FString StoreId; // 0x38

    };

    struct FAdminGetTaskInstancesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetTaskInstancesResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Summaries; // 0x8

    };

    struct FAdminGetTasksResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetTasksResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Tasks; // 0x8

    };

    struct FAdminGetTitleDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetTitleDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Data; // 0x8

    };

    struct FAdminLookupUserAccountInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminLookupUserAccountInfoResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* UserInfo; // 0x8

    };

    struct FAdminGetUserBansResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetUserBansResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FAdminGetUserDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetUserDataResult
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Data; // 0x8
        int32_t DataVersion; // 0x10
        struct FString PlayFabId; // 0x18

    };

    struct FAdminGetUserInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGetUserInventoryResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<class UPlayFabJsonObject*> Inventory; // 0x8
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* VirtualCurrency; // 0x28
        class UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x30

    };

    struct FAdminGrantItemsToUsersResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminGrantItemsToUsersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> ItemGrantResults; // 0x8

    };

    struct FAdminIncrementLimitedEditionItemAvailabilityResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminIncrementLimitedEditionItemAvailabilityResult
    {
    public:


    };

    struct FAdminIncrementPlayerStatisticVersionResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminIncrementPlayerStatisticVersionResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* StatisticVersion; // 0x8

    };

    struct FAdminListOpenIdConnectionResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AdminListOpenIdConnectionResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Connections; // 0x8

    };

    struct FAdminListBuildsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminListBuildsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Builds; // 0x8

    };

    struct FAdminListVirtualCurrencyTypesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminListVirtualCurrencyTypesResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> VirtualCurrencies; // 0x8

    };

    struct FAdminModifyMatchmakerGameModesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminModifyMatchmakerGameModesResult
    {
    public:


    };

    struct FAdminModifyServerBuildResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminModifyServerBuildResult
    {
    //Children Prop Count (Fields): 10
    public:

        struct FString ActiveRegions; // 0x8
        struct FString BuildId; // 0x18
        struct FString CommandLineTemplate; // 0x28
        struct FString Comment; // 0x38
        struct FString ExecutablePath; // 0x48
        int32_t MaxGamesPerHost; // 0x58
        int32_t MinFreeGameSlots; // 0x5c
        enum class EGameBuildStatus Status; // 0x60
        struct FString Timestamp; // 0x68
        struct FString TitleId; // 0x78

    };

    struct FAdminRefundPurchaseResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRefundPurchaseResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PurchaseStatus; // 0x8

    };

    struct FAdminRemovePlayerTagResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRemovePlayerTagResult
    {
    public:


    };

    struct FAdminRemoveServerBuildResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRemoveServerBuildResult
    {
    public:


    };

    struct FAdminResetCharacterStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminResetCharacterStatisticsResult
    {
    public:


    };

    struct FAdminResetPasswordResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminResetPasswordResult
    {
    public:


    };

    struct FAdminResetUserStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminResetUserStatisticsResult
    {
    public:


    };

    struct FAdminResolvePurchaseDisputeResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AdminResolvePurchaseDisputeResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PurchaseStatus; // 0x8

    };

    struct FAdminRevokeAllBansForUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRevokeAllBansForUserResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FAdminRevokeBansResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRevokeBansResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FAdminRevokeInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRevokeInventoryResult
    {
    public:


    };

    struct FAdminRevokeInventoryItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRevokeInventoryItemsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Errors; // 0x8

    };

    struct FAdminRunTaskResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminRunTaskResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TaskInstanceId; // 0x8

    };

    struct FAdminSendAccountRecoveryEmailResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSendAccountRecoveryEmailResult
    {
    public:


    };

    struct FAdminUpdateCatalogItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateCatalogItemsResult
    {
    public:


    };

    struct FAdminSetPlayerSecretResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSetPlayerSecretResult
    {
    public:


    };

    struct FAdminSetPublishedRevisionResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSetPublishedRevisionResult
    {
    public:


    };

    struct FAdminSetPublisherDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSetPublisherDataResult
    {
    public:


    };

    struct FAdminUpdateStoreItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateStoreItemsResult
    {
    public:


    };

    struct FAdminSetTitleDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSetTitleDataResult
    {
    public:


    };

    struct FAdminSetTitleDataAndOverridesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSetTitleDataAndOverridesResult
    {
    public:


    };

    struct FAdminSetupPushNotificationResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminSetupPushNotificationResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ARN; // 0x8

    };

    struct FAdminUpdateBansResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateBansResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FAdminUpdateCloudScriptResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateCloudScriptResult
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Revision; // 0x8
        int32_t Version; // 0xc

    };

    struct FAdminUpdatePlayerSharedSecretResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdatePlayerSharedSecretResult
    {
    public:


    };

    struct FAdminUpdatePlayerStatisticDefinitionResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdatePlayerStatisticDefinitionResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Statistic; // 0x8

    };

    struct FAdminUpdatePolicyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdatePolicyResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PolicyName; // 0x8
        struct TArray<class UPlayFabJsonObject*> Statements; // 0x18

    };

    struct FAdminUpdateRandomResultTablesResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateRandomResultTablesResult
    {
    public:


    };

    struct FAdminUpdateUserDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateUserDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t DataVersion; // 0x8

    };

    struct FAdminUpdateUserTitleDisplayNameResult : FPlayFabResultCommon //ScriptStruct PlayFab.AdminUpdateUserTitleDisplayNameResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString DisplayName; // 0x8

    };

    struct FAdminDeleteContentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteContentRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Key; // 0x8

    };

    struct FAdminDeleteMasterPlayerAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteMasterPlayerAccountRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString MetaData; // 0x8
        struct FString PlayFabId; // 0x18

    };

    struct FAdminDeleteOpenIdConnectionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteOpenIdConnectionRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ConnectionId; // 0x8

    };

    struct FAdminDeletePlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeletePlayerRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FAdminDeletePlayerSharedSecretRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeletePlayerSharedSecretRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SecretKey; // 0x8

    };

    struct FAdminDeleteStoreRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteStoreRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString StoreId; // 0x20

    };

    struct FAdminDeleteTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteTaskRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Identifier; // 0x8

    };

    struct FAdminDeleteTitleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteTitleRequest
    {
    public:


    };

    struct FAdminDeleteTitleDataOverrideRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminDeleteTitleDataOverrideRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString OverrideLabel; // 0x8

    };

    struct FAdminExportMasterPlayerDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminExportMasterPlayerDataRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FAdminGetTaskInstanceRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetTaskInstanceRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TaskInstanceId; // 0x8

    };

    struct FAdminGetAllSegmentsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetAllSegmentsRequest
    {
    public:


    };

    struct FAdminGetCatalogItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetCatalogItemsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString CatalogVersion; // 0x8

    };

    struct FAdminGetCloudScriptRevisionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetCloudScriptRevisionRequest
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Revision; // 0x8
        int32_t Version; // 0xc

    };

    struct FAdminGetCloudScriptVersionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetCloudScriptVersionsRequest
    {
    public:


    };

    struct FAdminGetContentListRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetContentListRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Prefix; // 0x8

    };

    struct FAdminGetContentUploadUrlRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetContentUploadUrlRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ContentType; // 0x8
        struct FString Key; // 0x18

    };

    struct FAdminGetDataReportRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetDataReportRequest
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Day; // 0x8
        int32_t Month; // 0xc
        struct FString ReportName; // 0x10
        int32_t Year; // 0x20

    };

    struct FAdminGetMatchmakerGameInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetMatchmakerGameInfoRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString LobbyId; // 0x8

    };

    struct FAdminGetMatchmakerGameModesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetMatchmakerGameModesRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString BuildVersion; // 0x8

    };

    struct FAdminGetPlayedTitleListRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayedTitleListRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FAdminGetPlayerIdFromAuthTokenRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayerIdFromAuthTokenRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Token; // 0x8
        enum class EAuthTokenType TokenType; // 0x18

    };

    struct FAdminGetPlayerProfileRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayerProfileRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        class UPlayFabJsonObject* ProfileConstraints; // 0x20

    };

    struct FAdminGetPlayersSegmentsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayersSegmentsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FAdminGetPlayerSharedSecretsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayerSharedSecretsRequest
    {
    public:


    };

    struct FAdminGetPlayersInSegmentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayersInSegmentRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString ContinuationToken; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        int32_t MaxBatchSize; // 0x20
        int32_t SecondsToLive; // 0x24
        struct FString SegmentId; // 0x28

    };

    struct FAdminGetPlayerStatisticDefinitionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayerStatisticDefinitionsRequest
    {
    public:


    };

    struct FAdminGetPlayerStatisticVersionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayerStatisticVersionsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString StatisticName; // 0x10

    };

    struct FAdminGetPlayerTagsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPlayerTagsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Namespace; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FAdminGetPolicyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPolicyRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PolicyName; // 0x8

    };

    struct FAdminGetPublisherDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetPublisherDataRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Keys; // 0x8

    };

    struct FAdminGetRandomResultTablesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetRandomResultTablesRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString CatalogVersion; // 0x8

    };

    struct FAdminGetServerBuildInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetServerBuildInfoRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString BuildId; // 0x8

    };

    struct FAdminGetServerBuildUploadURLRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetServerBuildUploadURLRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString BuildId; // 0x8

    };

    struct FAdminGetStoreItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetStoreItemsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CatalogVersion; // 0x8
        struct FString StoreId; // 0x18

    };

    struct FAdminGetTaskInstancesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetTaskInstancesRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString StartedAtRangeFrom; // 0x8
        struct FString StartedAtRangeTo; // 0x18
        enum class ETaskInstanceStatus StatusFilter; // 0x28
        class UPlayFabJsonObject* TaskIdentifier; // 0x30

    };

    struct FAdminGetTasksRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetTasksRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Identifier; // 0x8

    };

    struct FAdminGetTitleDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetTitleDataRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Keys; // 0x8
        struct FString OverrideLabel; // 0x18

    };

    struct FAdminLookupUserAccountInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminLookupUserAccountInfoRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString Email; // 0x8
        struct FString PlayFabId; // 0x18
        struct FString TitleDisplayName; // 0x28
        struct FString Username; // 0x38

    };

    struct FAdminGetUserBansRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetUserBansRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FAdminGetUserDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetUserDataRequest
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t IfChangedFromDataVersion; // 0x8
        struct FString Keys; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FAdminGetUserInventoryRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGetUserInventoryRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FAdminGrantItemsToUsersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminGrantItemsToUsersRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct TArray<class UPlayFabJsonObject*> ItemGrants; // 0x20

    };

    struct FAdminIncrementLimitedEditionItemAvailabilityRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminIncrementLimitedEditionItemAvailabilityRequest
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Amount; // 0x8
        struct FString CatalogVersion; // 0x10
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString ItemId; // 0x28

    };

    struct FAdminIncrementPlayerStatisticVersionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminIncrementPlayerStatisticVersionRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString StatisticName; // 0x10

    };

    struct FAdminListOpenIdConnectionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminListOpenIdConnectionRequest
    {
    public:


    };

    struct FAdminListBuildsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminListBuildsRequest
    {
    public:


    };

    struct FAdminListVirtualCurrencyTypesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminListVirtualCurrencyTypesRequest
    {
    public:


    };

    struct FAdminModifyMatchmakerGameModesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminModifyMatchmakerGameModesRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString BuildVersion; // 0x8
        struct TArray<class UPlayFabJsonObject*> GameModes; // 0x18

    };

    struct FAdminModifyServerBuildRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminModifyServerBuildRequest
    {
    //Children Prop Count (Fields): 9
    public:

        struct FString ActiveRegions; // 0x8
        struct FString BuildId; // 0x18
        struct FString CommandLineTemplate; // 0x28
        struct FString Comment; // 0x38
        class UPlayFabJsonObject* CustomTags; // 0x48
        struct FString ExecutablePath; // 0x50
        int32_t MaxGamesPerHost; // 0x60
        int32_t MinFreeGameSlots; // 0x64
        struct FString Timestamp; // 0x68

    };

    struct FAdminRefundPurchaseRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRefundPurchaseRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString OrderId; // 0x8
        struct FString PlayFabId; // 0x18
        struct FString Reason; // 0x28

    };

    struct FAdminRemovePlayerTagRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRemovePlayerTagRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString TagName; // 0x20

    };

    struct FAdminRemoveServerBuildRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRemoveServerBuildRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString BuildId; // 0x8

    };

    struct FAdminRemoveVirtualCurrencyTypesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRemoveVirtualCurrencyTypesRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> VirtualCurrencies; // 0x8

    };

    struct FAdminResetCharacterStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminResetCharacterStatisticsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString PlayFabId; // 0x20

    };

    struct FAdminResetPasswordRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminResetPasswordRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Password; // 0x10
        struct FString Token; // 0x20

    };

    struct FAdminResetUserStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminResetUserStatisticsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FAdminResolvePurchaseDisputeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminResolvePurchaseDisputeRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString OrderId; // 0x8
        enum class EResolutionOutcome Outcome; // 0x18
        struct FString PlayFabId; // 0x20
        struct FString Reason; // 0x30

    };

    struct FAdminRevokeAllBansForUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRevokeAllBansForUserRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FAdminRevokeBansRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRevokeBansRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString BanIds; // 0x8

    };

    struct FAdminRevokeInventoryItemRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRevokeInventoryItemRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        struct FString ItemInstanceId; // 0x18
        struct FString PlayFabId; // 0x28

    };

    struct FAdminRevokeInventoryItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRevokeInventoryItemsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Items; // 0x8

    };

    struct FAdminRunTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminRunTaskRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Identifier; // 0x10

    };

    struct FAdminSendAccountRecoveryEmailRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSendAccountRecoveryEmailRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Email; // 0x10
        struct FString EmailTemplateId; // 0x20

    };

    struct FAdminUpdateCatalogItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateCatalogItemsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<class UPlayFabJsonObject*> Catalog; // 0x8
        struct FString CatalogVersion; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        bool SetAsDefaultCatalog; // 0x30

    };

    struct FAdminSetPlayerSecretRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSetPlayerSecretRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayerSecret; // 0x8
        struct FString PlayFabId; // 0x18

    };

    struct FAdminSetPublishedRevisionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSetPublishedRevisionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t Revision; // 0x10
        int32_t Version; // 0x14

    };

    struct FAdminSetPublisherDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSetPublisherDataRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Key; // 0x8
        struct FString Value; // 0x18

    };

    struct FAdminUpdateStoreItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateStoreItemsRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        class UPlayFabJsonObject* MarketingData; // 0x20
        struct TArray<class UPlayFabJsonObject*> Store; // 0x28
        struct FString StoreId; // 0x38

    };

    struct FAdminSetTitleDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSetTitleDataRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Key; // 0x8
        struct FString Value; // 0x18

    };

    struct FAdminSetTitleDataAndOverridesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSetTitleDataAndOverridesRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<class UPlayFabJsonObject*> KeyValues; // 0x8
        struct FString OverrideLabel; // 0x18

    };

    struct FAdminSetupPushNotificationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSetupPushNotificationRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString Credential; // 0x8
        struct FString Key; // 0x18
        struct FString Name; // 0x28
        bool OverwriteOldARN; // 0x38
        enum class EPushSetupPlatform Platform; // 0x39

    };

    struct FAdminSubtractUserVirtualCurrencyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminSubtractUserVirtualCurrencyRequest
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Amount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString PlayFabId; // 0x18
        struct FString VirtualCurrency; // 0x28

    };

    struct FAdminUpdateBansRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateBansRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Bans; // 0x8

    };

    struct FAdminUpdateCloudScriptRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateCloudScriptRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DeveloperPlayFabId; // 0x10
        struct TArray<class UPlayFabJsonObject*> Files; // 0x20
        bool Publish; // 0x30

    };

    struct FAdminUpdateOpenIdConnectionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateOpenIdConnectionRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString ClientId; // 0x8
        struct FString ClientSecret; // 0x18
        struct FString ConnectionId; // 0x28
        struct FString IssuerDiscoveryUrl; // 0x38
        class UPlayFabJsonObject* IssuerInformation; // 0x48

    };

    struct FAdminUpdatePlayerSharedSecretRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdatePlayerSharedSecretRequest
    {
    //Children Prop Count (Fields): 3
    public:

        bool Disabled; // 0x8
        struct FString FriendlyName; // 0x10
        struct FString SecretKey; // 0x20

    };

    struct FAdminUpdatePlayerStatisticDefinitionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdatePlayerStatisticDefinitionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EStatisticAggregationMethod AggregationMethod; // 0x8
        struct FString StatisticName; // 0x10
        enum class EStatisticResetIntervalOption VersionChangeInterval; // 0x20

    };

    struct FAdminUpdatePolicyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdatePolicyRequest
    {
    //Children Prop Count (Fields): 3
    public:

        bool OverwritePolicy; // 0x8
        struct FString PolicyName; // 0x10
        struct TArray<class UPlayFabJsonObject*> Statements; // 0x20

    };

    struct FAdminUpdateRandomResultTablesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateRandomResultTablesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct TArray<class UPlayFabJsonObject*> Tables; // 0x20

    };

    struct FAdminUpdateTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateTaskRequest
    {
    //Children Prop Count (Fields): 8
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Description; // 0x10
        class UPlayFabJsonObject* Identifier; // 0x20
        bool IsActive; // 0x28
        struct FString Name; // 0x30
        class UPlayFabJsonObject* Parameter; // 0x40
        struct FString Schedule; // 0x48
        enum class EScheduledTaskType Type; // 0x58

    };

    struct FAdminUpdateUserDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateUserDataRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Data; // 0x10
        struct FString KeysToRemove; // 0x18
        enum class EUserDataPermission Permission; // 0x28
        struct FString PlayFabId; // 0x30

    };

    struct FAdminUpdateUserInternalDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateUserInternalDataRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Data; // 0x10
        struct FString KeysToRemove; // 0x18
        struct FString PlayFabId; // 0x28

    };

    struct FAdminUpdateUserTitleDisplayNameRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AdminUpdateUserTitleDisplayNameRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DisplayName; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FAuthenticationGetEntityTokenResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AuthenticationGetEntityTokenResponse
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        struct FString EntityToken; // 0x10
        struct FString TokenExpiration; // 0x20

    };

    struct FAuthenticationValidateEntityTokenResponse : FPlayFabResultCommon //ScriptStruct PlayFab.AuthenticationValidateEntityTokenResponse
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        enum class EIdentifiedDeviceType IdentifiedDeviceType; // 0x10
        enum class ELoginIdentityProvider IdentityProvider; // 0x11
        class UPlayFabJsonObject* Lineage; // 0x18

    };

    struct FAuthenticationGetEntityTokenRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AuthenticationGetEntityTokenRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10

    };

    struct FAuthenticationValidateEntityTokenRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.AuthenticationValidateEntityTokenRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString EntityToken; // 0x10

    };

    struct FClientAcceptTradeResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAcceptTradeResponse
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Trade; // 0x8

    };

    struct FClientAcceptTradeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAcceptTradeRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AcceptedInventoryInstanceIds; // 0x8
        struct FString OfferingPlayerId; // 0x18
        struct FString TradeId; // 0x28

    };

    struct FClientAddFriendResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAddFriendResult
    {
    //Children Prop Count (Fields): 1
    public:

        bool Created; // 0x8

    };

    struct FClientAddFriendRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAddFriendRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString FriendEmail; // 0x8
        struct FString FriendPlayFabId; // 0x18
        struct FString FriendTitleDisplayName; // 0x28
        struct FString FriendUsername; // 0x38

    };

    struct FClientAddGenericIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAddGenericIDResult
    {
    public:


    };

    struct FClientAddGenericIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAddGenericIDRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* GenericId; // 0x8

    };

    struct FClientAddOrUpdateContactEmailResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAddOrUpdateContactEmailResult
    {
    public:


    };

    struct FClientAddOrUpdateContactEmailRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAddOrUpdateContactEmailRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString EmailAddress; // 0x10

    };

    struct FClientAddSharedGroupMembersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAddSharedGroupMembersResult
    {
    public:


    };

    struct FClientAddSharedGroupMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAddSharedGroupMembersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabIds; // 0x8
        struct FString SharedGroupId; // 0x18

    };

    struct FClientAddUsernamePasswordResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAddUsernamePasswordResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Username; // 0x8

    };

    struct FClientAddUsernamePasswordRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAddUsernamePasswordRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Email; // 0x10
        struct FString Password; // 0x20
        struct FString Username; // 0x30

    };

    struct FClientModifyUserVirtualCurrencyResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientModifyUserVirtualCurrencyResult
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Balance; // 0x8
        int32_t BalanceChange; // 0xc
        struct FString PlayFabId; // 0x10
        struct FString VirtualCurrency; // 0x20

    };

    struct FClientAddUserVirtualCurrencyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAddUserVirtualCurrencyRequest
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t Amount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString VirtualCurrency; // 0x18

    };

    struct FClientAndroidDevicePushNotificationRegistrationResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAndroidDevicePushNotificationRegistrationResult
    {
    public:


    };

    struct FClientAndroidDevicePushNotificationRegistrationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAndroidDevicePushNotificationRegistrationRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ConfirmationMessage; // 0x8
        struct FString DeviceToken; // 0x18
        bool SendPushNotificationConfirmation; // 0x28

    };

    struct FClientAttributeInstallResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientAttributeInstallResult
    {
    public:


    };

    struct FClientAttributeInstallRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientAttributeInstallRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Adid; // 0x8
        struct FString Idfa; // 0x18

    };

    struct FClientCancelTradeResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientCancelTradeResponse
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Trade; // 0x8

    };

    struct FClientCancelTradeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientCancelTradeRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TradeId; // 0x8

    };

    struct FClientConfirmPurchaseResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientConfirmPurchaseResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Items; // 0x8
        struct FString OrderId; // 0x18
        struct FString PurchaseDate; // 0x28

    };

    struct FClientConfirmPurchaseRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientConfirmPurchaseRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString OrderId; // 0x10

    };

    struct FClientConsumeItemResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientConsumeItemResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ItemInstanceId; // 0x8
        int32_t RemainingUses; // 0x18

    };

    struct FClientConsumeItemRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientConsumeItemRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        int32_t ConsumeCount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString ItemInstanceId; // 0x28

    };

    struct FClientConsumePSNEntitlementsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientConsumePSNEntitlementsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> ItemsGranted; // 0x8

    };

    struct FClientConsumePSNEntitlementsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientConsumePSNEntitlementsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        int32_t ServiceLabel; // 0x20

    };

    struct FClientConsumeXboxEntitlementsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientConsumeXboxEntitlementsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Items; // 0x8

    };

    struct FClientConsumeXboxEntitlementsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientConsumeXboxEntitlementsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString XboxToken; // 0x20

    };

    struct FClientCreateSharedGroupResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientCreateSharedGroupResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SharedGroupId; // 0x8

    };

    struct FClientCreateSharedGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientCreateSharedGroupRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SharedGroupId; // 0x8

    };

    struct FClientExecuteCloudScriptResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientExecuteCloudScriptResult
    {
    //Children Prop Count (Fields): 12
    public:

        int32_t APIRequestsIssued; // 0x8
        class UPlayFabJsonObject* Error; // 0x10
        int32_t ExecutionTimeSeconds; // 0x18
        struct FString FunctionName; // 0x20
        class UPlayFabJsonObject* FunctionResult; // 0x30
        bool FunctionResultTooLarge; // 0x38
        int32_t HttpRequestsIssued; // 0x3c
        struct TArray<class UPlayFabJsonObject*> Logs; // 0x40
        bool LogsTooLarge; // 0x50
        int32_t MemoryConsumedBytes; // 0x54
        int32_t ProcessorTimeSeconds; // 0x58
        int32_t Revision; // 0x5c

    };

    struct FClientGetAccountInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetAccountInfoResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* AccountInfo; // 0x8

    };

    struct FClientGetAdPlacementsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetAdPlacementsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> AdPlacements; // 0x8

    };

    struct FClientListUsersCharactersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientListUsersCharactersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Characters; // 0x8

    };

    struct FClientGetCatalogItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetCatalogItemsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Catalog; // 0x8

    };

    struct FClientGetCharacterDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetCharacterDataResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* Data; // 0x18
        int32_t DataVersion; // 0x20

    };

    struct FClientGetCharacterInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetCharacterInventoryResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        struct TArray<class UPlayFabJsonObject*> Inventory; // 0x18
        class UPlayFabJsonObject* VirtualCurrency; // 0x28
        class UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x30

    };

    struct FClientGetCharacterLeaderboardResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetCharacterLeaderboardResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8

    };

    struct FClientGetCharacterStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetCharacterStatisticsResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CharacterStatistics; // 0x8

    };

    struct FClientGetContentDownloadUrlResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetContentDownloadUrlResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString URL; // 0x8

    };

    struct FClientCurrentGamesResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientCurrentGamesResult
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t GameCount; // 0x8
        struct TArray<class UPlayFabJsonObject*> Games; // 0x10
        int32_t PlayerCount; // 0x20

    };

    struct FClientGetLeaderboardResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetLeaderboardResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8
        struct FString NextReset; // 0x18
        int32_t Version; // 0x28

    };

    struct FClientGetFriendLeaderboardAroundPlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetFriendLeaderboardAroundPlayerResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8
        struct FString NextReset; // 0x18
        int32_t Version; // 0x28

    };

    struct FClientGetFriendsListResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetFriendsListResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Friends; // 0x8

    };

    struct FClientGameServerRegionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGameServerRegionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Regions; // 0x8

    };

    struct FClientGetLeaderboardAroundCharacterResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetLeaderboardAroundCharacterResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8

    };

    struct FClientGetLeaderboardAroundPlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetLeaderboardAroundPlayerResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8
        struct FString NextReset; // 0x18
        int32_t Version; // 0x28

    };

    struct FClientGetLeaderboardForUsersCharactersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetLeaderboardForUsersCharactersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8

    };

    struct FClientGetPaymentTokenResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPaymentTokenResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString OrderId; // 0x8
        struct FString ProviderToken; // 0x18

    };

    struct FClientGetPhotonAuthenticationTokenResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPhotonAuthenticationTokenResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PhotonCustomAuthenticationToken; // 0x8

    };

    struct FClientGetPlayerCombinedInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerCombinedInfoResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* InfoResultPayload; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FClientGetPlayerProfileResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerProfileResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* PlayerProfile; // 0x8

    };

    struct FClientGetPlayerSegmentsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerSegmentsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Segments; // 0x8

    };

    struct FClientGetPlayerStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerStatisticsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Statistics; // 0x8

    };

    struct FClientGetPlayerStatisticVersionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerStatisticVersionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> StatisticVersions; // 0x8

    };

    struct FClientGetPlayerTagsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerTagsResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabId; // 0x8
        struct FString Tags; // 0x18

    };

    struct FClientGetPlayerTradesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayerTradesResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<class UPlayFabJsonObject*> AcceptedTrades; // 0x8
        struct TArray<class UPlayFabJsonObject*> OpenedTrades; // 0x18

    };

    struct FClientGetPlayFabIDsFromFacebookIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookInstantGamesIdsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromGameCenterIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromGameCenterIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromGenericIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromGenericIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromGoogleIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromGoogleIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromKongregateIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromKongregateIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromPSNAccountIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromPSNAccountIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromSteamIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromSteamIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromTwitchIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromTwitchIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPlayFabIDsFromXboxLiveIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromXboxLiveIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FClientGetPublisherDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPublisherDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Data; // 0x8

    };

    struct FClientGetPurchaseResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetPurchaseResult
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString OrderId; // 0x8
        struct FString PaymentProvider; // 0x18
        struct FString PurchaseDate; // 0x28
        struct FString TransactionId; // 0x38
        struct FString TransactionStatus; // 0x48

    };

    struct FClientGetSharedGroupDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetSharedGroupDataResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Data; // 0x8
        struct FString Members; // 0x10

    };

    struct FClientGetStoreItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetStoreItemsResult
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* MarketingData; // 0x18
        enum class EPfSourceType Source; // 0x20
        struct TArray<class UPlayFabJsonObject*> Store; // 0x28
        struct FString StoreId; // 0x38

    };

    struct FClientGetTimeResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetTimeResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Time; // 0x8

    };

    struct FClientGetTitleDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetTitleDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Data; // 0x8

    };

    struct FClientGetTitleNewsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetTitleNewsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> News; // 0x8

    };

    struct FClientGetTitlePublicKeyResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetTitlePublicKeyResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString RSAPublicKey; // 0x8

    };

    struct FClientGetTradeStatusResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetTradeStatusResponse
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Trade; // 0x8

    };

    struct FClientGetUserDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetUserDataResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Data; // 0x8
        int32_t DataVersion; // 0x10

    };

    struct FClientGetUserInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetUserInventoryResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Inventory; // 0x8
        class UPlayFabJsonObject* VirtualCurrency; // 0x18
        class UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x20

    };

    struct FClientGetWindowsHelloChallengeResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGetWindowsHelloChallengeResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Challenge; // 0x8

    };

    struct FClientGrantCharacterToUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientGrantCharacterToUserResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        struct FString CharacterType; // 0x18
        bool Result; // 0x28

    };

    struct FClientLinkAndroidDeviceIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkAndroidDeviceIDResult
    {
    public:


    };

    struct FClientEmptyResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientEmptyResult
    {
    public:


    };

    struct FClientLinkCustomIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkCustomIDResult
    {
    public:


    };

    struct FClientLinkFacebookAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkFacebookAccountResult
    {
    public:


    };

    struct FClientLinkFacebookInstantGamesIdResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkFacebookInstantGamesIdResult
    {
    public:


    };

    struct FClientLinkGameCenterAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkGameCenterAccountResult
    {
    public:


    };

    struct FClientLinkGoogleAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkGoogleAccountResult
    {
    public:


    };

    struct FClientLinkIOSDeviceIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkIOSDeviceIDResult
    {
    public:


    };

    struct FClientLinkKongregateAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkKongregateAccountResult
    {
    public:


    };

    struct FClientLinkNintendoSwitchDeviceIdResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkNintendoSwitchDeviceIdResult
    {
    public:


    };

    struct FClientLinkPSNAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkPSNAccountResult
    {
    public:


    };

    struct FClientLinkSteamAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkSteamAccountResult
    {
    public:


    };

    struct FClientLinkTwitchAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkTwitchAccountResult
    {
    public:


    };

    struct FClientLinkWindowsHelloAccountResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkWindowsHelloAccountResponse
    {
    public:


    };

    struct FClientLinkXboxAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientLinkXboxAccountResult
    {
    public:


    };

    struct FPlayFabLoginResultCommon : FPlayFabResultCommon //ScriptStruct PlayFab.PlayFabLoginResultCommon
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabAuthenticationContext* AuthenticationContext; // 0x8

    };

    struct FClientLoginResult : FPlayFabLoginResultCommon //ScriptStruct PlayFab.ClientLoginResult
    {
    //Children Prop Count (Fields): 8
    public:

        class UPlayFabJsonObject* EntityToken; // 0x10
        class UPlayFabJsonObject* InfoResultPayload; // 0x18
        struct FString LastLoginTime; // 0x20
        bool NewlyCreated; // 0x30
        struct FString PlayFabId; // 0x38
        struct FString SessionTicket; // 0x48
        class UPlayFabJsonObject* SettingsForUser; // 0x58
        class UPlayFabJsonObject* TreatmentAssignment; // 0x60

    };

    struct FClientMatchmakeResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientMatchmakeResult
    {
    //Children Prop Count (Fields): 9
    public:

        struct FString Expires; // 0x8
        struct FString LobbyId; // 0x18
        int32_t PollWaitTimeMS; // 0x28
        struct FString ServerIPV4Address; // 0x30
        struct FString ServerIPV6Address; // 0x40
        int32_t ServerPort; // 0x50
        struct FString ServerPublicDNSName; // 0x58
        enum class EMatchmakeStatus Status; // 0x68
        struct FString Ticket; // 0x70

    };

    struct FClientOpenTradeResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientOpenTradeResponse
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Trade; // 0x8

    };

    struct FClientPayForPurchaseResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientPayForPurchaseResult
    {
    //Children Prop Count (Fields): 10
    public:

        int32_t CreditApplied; // 0x8
        struct FString OrderId; // 0x10
        struct FString ProviderData; // 0x20
        struct FString ProviderToken; // 0x30
        struct FString PurchaseConfirmationPageURL; // 0x40
        struct FString PurchaseCurrency; // 0x50
        int32_t PurchasePrice; // 0x60
        enum class ETransactionStatus Status; // 0x64
        class UPlayFabJsonObject* VCAmount; // 0x68
        class UPlayFabJsonObject* VirtualCurrency; // 0x70

    };

    struct FClientPurchaseItemResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientPurchaseItemResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Items; // 0x8

    };

    struct FClientRedeemCouponResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRedeemCouponResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> GrantedItems; // 0x8

    };

    struct FClientEmptyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientEmptyResponse
    {
    public:


    };

    struct FClientRegisterForIOSPushNotificationResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRegisterForIOSPushNotificationResult
    {
    public:


    };

    struct FClientRegisterPlayFabUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRegisterPlayFabUserResult
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* EntityToken; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString SessionTicket; // 0x20
        class UPlayFabJsonObject* SettingsForUser; // 0x30
        struct FString Username; // 0x38

    };

    struct FClientRemoveContactEmailResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRemoveContactEmailResult
    {
    public:


    };

    struct FClientRemoveFriendResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRemoveFriendResult
    {
    public:


    };

    struct FClientRemoveGenericIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRemoveGenericIDResult
    {
    public:


    };

    struct FClientRemoveSharedGroupMembersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRemoveSharedGroupMembersResult
    {
    public:


    };

    struct FClientReportAdActivityResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientReportAdActivityResult
    {
    public:


    };

    struct FClientReportPlayerClientResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientReportPlayerClientResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t SubmissionsRemaining; // 0x8

    };

    struct FClientRestoreIOSPurchasesResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRestoreIOSPurchasesResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Fulfillments; // 0x8

    };

    struct FClientRewardAdActivityResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientRewardAdActivityResult
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString AdActivityEventId; // 0x8
        struct FString DebugResults; // 0x18
        struct FString PlacementId; // 0x28
        struct FString PlacementName; // 0x38
        int32_t PlacementViewsRemaining; // 0x48
        int32_t PlacementViewsResetMinutes; // 0x4c
        class UPlayFabJsonObject* RewardResults; // 0x50

    };

    struct FClientSendAccountRecoveryEmailResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientSendAccountRecoveryEmailResult
    {
    public:


    };

    struct FClientSetFriendTagsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientSetFriendTagsResult
    {
    public:


    };

    struct FClientSetPlayerSecretResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientSetPlayerSecretResult
    {
    public:


    };

    struct FClientStartGameResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientStartGameResult
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString Expires; // 0x8
        struct FString LobbyId; // 0x18
        struct FString Password; // 0x28
        struct FString ServerIPV4Address; // 0x38
        struct FString ServerIPV6Address; // 0x48
        int32_t ServerPort; // 0x58
        struct FString ServerPublicDNSName; // 0x60
        struct FString Ticket; // 0x70

    };

    struct FClientStartPurchaseResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientStartPurchaseResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<class UPlayFabJsonObject*> Contents; // 0x8
        struct FString OrderId; // 0x18
        struct TArray<class UPlayFabJsonObject*> PaymentOptions; // 0x28
        class UPlayFabJsonObject* VirtualCurrencyBalances; // 0x38

    };

    struct FClientUnlinkAndroidDeviceIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkAndroidDeviceIDResult
    {
    public:


    };

    struct FClientUnlinkCustomIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkCustomIDResult
    {
    public:


    };

    struct FClientUnlinkFacebookAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkFacebookAccountResult
    {
    public:


    };

    struct FClientUnlinkFacebookInstantGamesIdResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkFacebookInstantGamesIdResult
    {
    public:


    };

    struct FClientUnlinkGameCenterAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkGameCenterAccountResult
    {
    public:


    };

    struct FClientUnlinkGoogleAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkGoogleAccountResult
    {
    public:


    };

    struct FClientUnlinkIOSDeviceIDResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkIOSDeviceIDResult
    {
    public:


    };

    struct FClientUnlinkKongregateAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkKongregateAccountResult
    {
    public:


    };

    struct FClientUnlinkNintendoSwitchDeviceIdResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkNintendoSwitchDeviceIdResult
    {
    public:


    };

    struct FClientUnlinkPSNAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkPSNAccountResult
    {
    public:


    };

    struct FClientUnlinkSteamAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkSteamAccountResult
    {
    public:


    };

    struct FClientUnlinkTwitchAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkTwitchAccountResult
    {
    public:


    };

    struct FClientUnlinkWindowsHelloAccountResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkWindowsHelloAccountResponse
    {
    public:


    };

    struct FClientUnlinkXboxAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlinkXboxAccountResult
    {
    public:


    };

    struct FClientUnlockContainerItemResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUnlockContainerItemResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<class UPlayFabJsonObject*> GrantedItems; // 0x8
        struct FString UnlockedItemInstanceId; // 0x18
        struct FString UnlockedWithItemInstanceId; // 0x28
        class UPlayFabJsonObject* VirtualCurrency; // 0x38

    };

    struct FClientUpdateCharacterDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUpdateCharacterDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t DataVersion; // 0x8

    };

    struct FClientUpdateCharacterStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUpdateCharacterStatisticsResult
    {
    public:


    };

    struct FClientUpdatePlayerStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUpdatePlayerStatisticsResult
    {
    public:


    };

    struct FClientUpdateSharedGroupDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUpdateSharedGroupDataResult
    {
    public:


    };

    struct FClientUpdateUserDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUpdateUserDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t DataVersion; // 0x8

    };

    struct FClientUpdateUserTitleDisplayNameResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientUpdateUserTitleDisplayNameResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString DisplayName; // 0x8

    };

    struct FClientValidateAmazonReceiptResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientValidateAmazonReceiptResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Fulfillments; // 0x8

    };

    struct FClientValidateGooglePlayPurchaseResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientValidateGooglePlayPurchaseResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Fulfillments; // 0x8

    };

    struct FClientValidateIOSReceiptResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientValidateIOSReceiptResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Fulfillments; // 0x8

    };

    struct FClientValidateWindowsReceiptResult : FPlayFabResultCommon //ScriptStruct PlayFab.ClientValidateWindowsReceiptResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Fulfillments; // 0x8

    };

    struct FClientWriteEventResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ClientWriteEventResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString EventId; // 0x8

    };

    struct FClientExecuteCloudScriptRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientExecuteCloudScriptRequest
    {
    //Children Prop Count (Fields): 6
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString FunctionName; // 0x10
        class UPlayFabJsonObject* FunctionParameter; // 0x20
        bool GeneratePlayStreamEvent; // 0x28
        enum class ECloudScriptRevisionOption RevisionSelection; // 0x29
        int32_t SpecificRevision; // 0x2c

    };

    struct FClientGetAccountInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetAccountInfoRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString Email; // 0x8
        struct FString PlayFabId; // 0x18
        struct FString TitleDisplayName; // 0x28
        struct FString Username; // 0x38

    };

    struct FClientGetAdPlacementsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetAdPlacementsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AppId; // 0x8
        class UPlayFabJsonObject* Identifier; // 0x18

    };

    struct FClientListUsersCharactersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientListUsersCharactersRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FClientGetCatalogItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetCatalogItemsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString CatalogVersion; // 0x8

    };

    struct FClientGetCharacterDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetCharacterDataRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        int32_t IfChangedFromDataVersion; // 0x18
        struct FString Keys; // 0x20
        struct FString PlayFabId; // 0x30

    };

    struct FClientGetCharacterInventoryRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetCharacterInventoryRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28

    };

    struct FClientGetCharacterLeaderboardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetCharacterLeaderboardRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterType; // 0x8
        int32_t MaxResultsCount; // 0x18
        int32_t StartPosition; // 0x1c
        struct FString StatisticName; // 0x20

    };

    struct FClientGetCharacterStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetCharacterStatisticsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString CharacterId; // 0x8

    };

    struct FClientGetContentDownloadUrlRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetContentDownloadUrlRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString HttpMethod; // 0x8
        struct FString Key; // 0x18
        bool ThruCDN; // 0x28

    };

    struct FClientCurrentGamesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientCurrentGamesRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString BuildVersion; // 0x8
        struct FString GameMode; // 0x18
        enum class ERegion Region; // 0x28
        struct FString StatisticName; // 0x30
        class UPlayFabJsonObject* TagFilter; // 0x40

    };

    struct FClientGetFriendLeaderboardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetFriendLeaderboardRequest
    {
    //Children Prop Count (Fields): 10
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool IncludeFacebookFriends; // 0x10
        bool IncludeSteamFriends; // 0x11
        int32_t MaxResultsCount; // 0x14
        class UPlayFabJsonObject* ProfileConstraints; // 0x18
        int32_t StartPosition; // 0x20
        struct FString StatisticName; // 0x28
        bool UseSpecificVersion; // 0x38
        int32_t Version; // 0x3c
        struct FString XboxToken; // 0x40

    };

    struct FClientGetFriendLeaderboardAroundPlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetFriendLeaderboardAroundPlayerRequest
    {
    //Children Prop Count (Fields): 10
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool IncludeFacebookFriends; // 0x10
        bool IncludeSteamFriends; // 0x11
        int32_t MaxResultsCount; // 0x14
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* ProfileConstraints; // 0x28
        struct FString StatisticName; // 0x30
        bool UseSpecificVersion; // 0x40
        int32_t Version; // 0x44
        struct FString XboxToken; // 0x48

    };

    struct FClientGetFriendsListRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetFriendsListRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool IncludeFacebookFriends; // 0x10
        bool IncludeSteamFriends; // 0x11
        class UPlayFabJsonObject* ProfileConstraints; // 0x18
        struct FString XboxToken; // 0x20

    };

    struct FClientGameServerRegionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGameServerRegionsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString BuildVersion; // 0x8

    };

    struct FClientGetLeaderboardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetLeaderboardRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t MaxResultsCount; // 0x10
        class UPlayFabJsonObject* ProfileConstraints; // 0x18
        int32_t StartPosition; // 0x20
        struct FString StatisticName; // 0x28
        bool UseSpecificVersion; // 0x38
        int32_t Version; // 0x3c

    };

    struct FClientGetLeaderboardAroundCharacterRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetLeaderboardAroundCharacterRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        struct FString CharacterType; // 0x18
        int32_t MaxResultsCount; // 0x28
        struct FString StatisticName; // 0x30

    };

    struct FClientGetLeaderboardAroundPlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetLeaderboardAroundPlayerRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t MaxResultsCount; // 0x10
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* ProfileConstraints; // 0x28
        struct FString StatisticName; // 0x30
        bool UseSpecificVersion; // 0x40
        int32_t Version; // 0x44

    };

    struct FClientGetLeaderboardForUsersCharactersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetLeaderboardForUsersCharactersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t MaxResultsCount; // 0x8
        struct FString StatisticName; // 0x10

    };

    struct FClientGetPaymentTokenRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPaymentTokenRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TokenProvider; // 0x8

    };

    struct FClientGetPhotonAuthenticationTokenRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPhotonAuthenticationTokenRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PhotonApplicationId; // 0x8

    };

    struct FClientGetPlayerCombinedInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerCombinedInfoRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* InfoRequestParameters; // 0x10
        struct FString PlayFabId; // 0x18

    };

    struct FClientGetPlayerProfileRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerProfileRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        class UPlayFabJsonObject* ProfileConstraints; // 0x20

    };

    struct FClientGetPlayerSegmentsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerSegmentsRequest
    {
    public:


    };

    struct FClientGetPlayerStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerStatisticsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString StatisticNames; // 0x10
        struct TArray<class UPlayFabJsonObject*> StatisticNameVersions; // 0x20

    };

    struct FClientGetPlayerStatisticVersionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerStatisticVersionsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString StatisticName; // 0x10

    };

    struct FClientGetPlayerTagsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerTagsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Namespace; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FClientGetPlayerTradesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayerTradesRequest
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ETradeStatus StatusFilter; // 0x8

    };

    struct FClientGetPlayFabIDsFromFacebookIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FacebookIDs; // 0x8

    };

    struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FacebookInstantGamesIds; // 0x8

    };

    struct FClientGetPlayFabIDsFromGameCenterIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromGameCenterIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString GameCenterIDs; // 0x8

    };

    struct FClientGetPlayFabIDsFromGenericIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromGenericIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> GenericIDs; // 0x8

    };

    struct FClientGetPlayFabIDsFromGoogleIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromGoogleIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString GoogleIDs; // 0x8

    };

    struct FClientGetPlayFabIDsFromKongregateIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromKongregateIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString KongregateIDs; // 0x8

    };

    struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString NintendoSwitchDeviceIds; // 0x8

    };

    struct FClientGetPlayFabIDsFromPSNAccountIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromPSNAccountIDsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t IssuerId; // 0x8
        struct FString PSNAccountIDs; // 0x10

    };

    struct FClientGetPlayFabIDsFromSteamIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromSteamIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SteamStringIDs; // 0x8

    };

    struct FClientGetPlayFabIDsFromTwitchIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromTwitchIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TwitchIds; // 0x8

    };

    struct FClientGetPlayFabIDsFromXboxLiveIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPlayFabIDsFromXboxLiveIDsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Sandbox; // 0x8
        struct FString XboxLiveAccountIDs; // 0x18

    };

    struct FClientGetPublisherDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPublisherDataRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Keys; // 0x8

    };

    struct FClientGetPurchaseRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetPurchaseRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString OrderId; // 0x8

    };

    struct FClientGetSharedGroupDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetSharedGroupDataRequest
    {
    //Children Prop Count (Fields): 3
    public:

        bool GetMembers; // 0x8
        struct FString Keys; // 0x10
        struct FString SharedGroupId; // 0x20

    };

    struct FClientGetStoreItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetStoreItemsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CatalogVersion; // 0x8
        struct FString StoreId; // 0x18

    };

    struct FClientGetTimeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetTimeRequest
    {
    public:


    };

    struct FClientGetTitleDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetTitleDataRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Keys; // 0x8
        struct FString OverrideLabel; // 0x18

    };

    struct FClientGetTitleNewsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetTitleNewsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Count; // 0x8

    };

    struct FClientGetTitlePublicKeyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetTitlePublicKeyRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TitleSharedSecret; // 0x8

    };

    struct FClientGetTradeStatusRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetTradeStatusRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString OfferingPlayerId; // 0x8
        struct FString TradeId; // 0x18

    };

    struct FClientGetUserDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetUserDataRequest
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t IfChangedFromDataVersion; // 0x8
        struct FString Keys; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FClientGetUserInventoryRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetUserInventoryRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientGetWindowsHelloChallengeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGetWindowsHelloChallengeRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PublicKeyHint; // 0x8

    };

    struct FClientGrantCharacterToUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientGrantCharacterToUserRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterName; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString ItemId; // 0x30

    };

    struct FClientLinkAndroidDeviceIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkAndroidDeviceIDRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString AndroidDevice; // 0x8
        struct FString AndroidDeviceId; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        bool ForceLink; // 0x30
        struct FString OS; // 0x38

    };

    struct FClientLinkAppleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkAppleRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString IdentityToken; // 0x18

    };

    struct FClientLinkCustomIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkCustomIDRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CustomId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20

    };

    struct FClientLinkFacebookAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkFacebookAccountRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AccessToken; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20

    };

    struct FClientLinkFacebookInstantGamesIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkFacebookInstantGamesIdRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString FacebookInstantGamesSignature; // 0x10
        bool ForceLink; // 0x20

    };

    struct FClientLinkGameCenterAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkGameCenterAccountRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString GameCenterId; // 0x18
        struct FString PublicKeyUrl; // 0x28
        struct FString Salt; // 0x38
        struct FString Signature; // 0x48
        struct FString Timestamp; // 0x58

    };

    struct FClientLinkGoogleAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkGoogleAccountRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString ServerAuthCode; // 0x18

    };

    struct FClientLinkIOSDeviceIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkIOSDeviceIDRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DeviceID; // 0x10
        struct FString DeviceModel; // 0x20
        bool ForceLink; // 0x30
        struct FString OS; // 0x38

    };

    struct FClientLinkKongregateAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkKongregateAccountRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString AuthTicket; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20
        struct FString KongregateId; // 0x28

    };

    struct FClientLinkNintendoServiceAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkNintendoServiceAccountRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString IdentityToken; // 0x18

    };

    struct FClientLinkNintendoSwitchDeviceIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkNintendoSwitchDeviceIdRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString NintendoSwitchDeviceId; // 0x18

    };

    struct FClientLinkOpenIdConnectRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkOpenIdConnectRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString ConnectionId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20
        struct FString IdToken; // 0x28

    };

    struct FClientLinkPSNAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkPSNAccountRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString AuthCode; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20
        int32_t IssuerId; // 0x24
        struct FString RedirectUri; // 0x28

    };

    struct FClientLinkSteamAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkSteamAccountRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString SteamTicket; // 0x18

    };

    struct FClientLinkTwitchAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkTwitchAccountRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AccessToken; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20

    };

    struct FClientLinkWindowsHelloAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkWindowsHelloAccountRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DeviceName; // 0x10
        bool ForceLink; // 0x20
        struct FString PublicKey; // 0x28
        struct FString Username; // 0x38

    };

    struct FClientLinkXboxAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLinkXboxAccountRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString XboxToken; // 0x18

    };

    struct FClientLoginWithAndroidDeviceIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithAndroidDeviceIDRequest
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString AndroidDevice; // 0x8
        struct FString AndroidDeviceId; // 0x18
        bool CreateAccount; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x30
        struct FString EncryptedRequest; // 0x38
        class UPlayFabJsonObject* InfoRequestParameters; // 0x48
        struct FString OS; // 0x50
        struct FString PlayerSecret; // 0x60

    };

    struct FClientLoginWithAppleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithAppleRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        struct FString IdentityToken; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithCustomIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithCustomIDRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        struct FString CustomId; // 0x10
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EncryptedRequest; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithEmailAddressRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithEmailAddressRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Email; // 0x10
        class UPlayFabJsonObject* InfoRequestParameters; // 0x20
        struct FString Password; // 0x28

    };

    struct FClientLoginWithFacebookRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithFacebookRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString AccessToken; // 0x8
        bool CreateAccount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EncryptedRequest; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithFacebookInstantGamesIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithFacebookInstantGamesIdRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        struct FString FacebookInstantGamesSignature; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithGameCenterRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithGameCenterRequest
    {
    //Children Prop Count (Fields): 10
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        class UPlayFabJsonObject* InfoRequestParameters; // 0x28
        struct FString PlayerId; // 0x30
        struct FString PlayerSecret; // 0x40
        struct FString PublicKeyUrl; // 0x50
        struct FString Salt; // 0x60
        struct FString Signature; // 0x70
        struct FString Timestamp; // 0x80

    };

    struct FClientLoginWithGoogleAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithGoogleAccountRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        class UPlayFabJsonObject* InfoRequestParameters; // 0x28
        struct FString PlayerSecret; // 0x30
        struct FString ServerAuthCode; // 0x40

    };

    struct FClientLoginWithIOSDeviceIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithIOSDeviceIDRequest
    {
    //Children Prop Count (Fields): 8
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString DeviceID; // 0x18
        struct FString DeviceModel; // 0x28
        struct FString EncryptedRequest; // 0x38
        class UPlayFabJsonObject* InfoRequestParameters; // 0x48
        struct FString OS; // 0x50
        struct FString PlayerSecret; // 0x60

    };

    struct FClientLoginWithKongregateRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithKongregateRequest
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString AuthTicket; // 0x8
        bool CreateAccount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EncryptedRequest; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString KongregateId; // 0x40
        struct FString PlayerSecret; // 0x50

    };

    struct FClientLoginWithNintendoServiceAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithNintendoServiceAccountRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        struct FString IdentityToken; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithNintendoSwitchDeviceIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithNintendoSwitchDeviceIdRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        class UPlayFabJsonObject* InfoRequestParameters; // 0x28
        struct FString NintendoSwitchDeviceId; // 0x30
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithOpenIdConnectRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithOpenIdConnectRequest
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString ConnectionId; // 0x8
        bool CreateAccount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EncryptedRequest; // 0x28
        struct FString IdToken; // 0x38
        class UPlayFabJsonObject* InfoRequestParameters; // 0x48
        struct FString PlayerSecret; // 0x50

    };

    struct FClientLoginWithPlayFabRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithPlayFabRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* InfoRequestParameters; // 0x10
        struct FString Password; // 0x18
        struct FString Username; // 0x28

    };

    struct FClientLoginWithPSNRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithPSNRequest
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString AuthCode; // 0x8
        bool CreateAccount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EncryptedRequest; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        int32_t IssuerId; // 0x40
        struct FString PlayerSecret; // 0x48
        struct FString RedirectUri; // 0x58

    };

    struct FClientLoginWithSteamRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithSteamRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        class UPlayFabJsonObject* InfoRequestParameters; // 0x28
        struct FString PlayerSecret; // 0x30
        struct FString SteamTicket; // 0x40

    };

    struct FClientLoginWithTwitchRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithTwitchRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString AccessToken; // 0x8
        bool CreateAccount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EncryptedRequest; // 0x28
        class UPlayFabJsonObject* InfoRequestParameters; // 0x38
        struct FString PlayerSecret; // 0x40

    };

    struct FClientLoginWithWindowsHelloRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithWindowsHelloRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString ChallengeSignature; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        class UPlayFabJsonObject* InfoRequestParameters; // 0x20
        struct FString PublicKeyHint; // 0x28

    };

    struct FClientLoginWithXboxRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientLoginWithXboxRequest
    {
    //Children Prop Count (Fields): 6
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EncryptedRequest; // 0x18
        class UPlayFabJsonObject* InfoRequestParameters; // 0x28
        struct FString PlayerSecret; // 0x30
        struct FString XboxToken; // 0x40

    };

    struct FClientMatchmakeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientMatchmakeRequest
    {
    //Children Prop Count (Fields): 9
    public:

        struct FString BuildVersion; // 0x8
        struct FString CharacterId; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString GameMode; // 0x30
        struct FString LobbyId; // 0x40
        enum class ERegion Region; // 0x50
        bool StartNewIfNoneFound; // 0x51
        struct FString StatisticName; // 0x58
        class UPlayFabJsonObject* TagFilter; // 0x68

    };

    struct FClientOpenTradeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientOpenTradeRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AllowedPlayerIds; // 0x8
        struct FString OfferedInventoryInstanceIds; // 0x18
        struct FString RequestedCatalogItemIds; // 0x28

    };

    struct FClientPayForPurchaseRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientPayForPurchaseRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString Currency; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString OrderId; // 0x20
        struct FString ProviderName; // 0x30
        struct FString ProviderTransactionId; // 0x40

    };

    struct FClientPurchaseItemRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientPurchaseItemRequest
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString ItemId; // 0x30
        int32_t Price; // 0x40
        struct FString StoreId; // 0x48
        struct FString VirtualCurrency; // 0x58

    };

    struct FClientRedeemCouponRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRedeemCouponRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        struct FString CouponCode; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38

    };

    struct FClientRefreshPSNAuthTokenRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRefreshPSNAuthTokenRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AuthCode; // 0x8
        int32_t IssuerId; // 0x18
        struct FString RedirectUri; // 0x20

    };

    struct FClientRegisterForIOSPushNotificationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRegisterForIOSPushNotificationRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ConfirmationMessage; // 0x8
        struct FString DeviceToken; // 0x18
        bool SendPushNotificationConfirmation; // 0x28

    };

    struct FClientRegisterPlayFabUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRegisterPlayFabUserRequest
    {
    //Children Prop Count (Fields): 9
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DisplayName; // 0x10
        struct FString Email; // 0x20
        struct FString EncryptedRequest; // 0x30
        class UPlayFabJsonObject* InfoRequestParameters; // 0x40
        struct FString Password; // 0x48
        struct FString PlayerSecret; // 0x58
        bool RequireBothUsernameAndEmail; // 0x68
        struct FString Username; // 0x70

    };

    struct FClientRegisterWithWindowsHelloRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRegisterWithWindowsHelloRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DeviceName; // 0x10
        struct FString EncryptedRequest; // 0x20
        class UPlayFabJsonObject* InfoRequestParameters; // 0x30
        struct FString PlayerSecret; // 0x38
        struct FString PublicKey; // 0x48
        struct FString Username; // 0x58

    };

    struct FClientRemoveContactEmailRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRemoveContactEmailRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientRemoveFriendRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRemoveFriendRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FriendPlayFabId; // 0x8

    };

    struct FClientRemoveGenericIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRemoveGenericIDRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* GenericId; // 0x8

    };

    struct FClientRemoveSharedGroupMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRemoveSharedGroupMembersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabIds; // 0x8
        struct FString SharedGroupId; // 0x18

    };

    struct FClientReportAdActivityRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientReportAdActivityRequest
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EAdActivity Activity; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString PlacementId; // 0x18
        struct FString RewardId; // 0x28

    };

    struct FClientDeviceInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientDeviceInfoRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Info; // 0x8

    };

    struct FClientReportPlayerClientRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientReportPlayerClientRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Comment; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString ReporteeId; // 0x20

    };

    struct FClientRestoreIOSPurchasesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRestoreIOSPurchasesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString ReceiptData; // 0x20

    };

    struct FClientRewardAdActivityRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientRewardAdActivityRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlacementId; // 0x10
        struct FString RewardId; // 0x20

    };

    struct FClientSendAccountRecoveryEmailRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientSendAccountRecoveryEmailRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Email; // 0x10
        struct FString EmailTemplateId; // 0x20

    };

    struct FClientSetFriendTagsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientSetFriendTagsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString FriendPlayFabId; // 0x8
        struct FString Tags; // 0x18

    };

    struct FClientSetPlayerSecretRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientSetPlayerSecretRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString EncryptedRequest; // 0x8
        struct FString PlayerSecret; // 0x18

    };

    struct FClientStartGameRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientStartGameRequest
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString BuildVersion; // 0x8
        struct FString CharacterId; // 0x18
        struct FString CustomCommandLineData; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38
        struct FString GameMode; // 0x40
        enum class ERegion Region; // 0x50
        struct FString StatisticName; // 0x58

    };

    struct FClientStartPurchaseRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientStartPurchaseRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct TArray<class UPlayFabJsonObject*> Items; // 0x20
        struct FString StoreId; // 0x30

    };

    struct FClientSubtractUserVirtualCurrencyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientSubtractUserVirtualCurrencyRequest
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t Amount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString VirtualCurrency; // 0x18

    };

    struct FClientUnlinkAndroidDeviceIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkAndroidDeviceIDRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AndroidDeviceId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FClientUnlinkAppleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkAppleRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkCustomIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkCustomIDRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CustomId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FClientUnlinkFacebookAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkFacebookAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkFacebookInstantGamesIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkFacebookInstantGamesIdRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString FacebookInstantGamesId; // 0x10

    };

    struct FClientUnlinkGameCenterAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkGameCenterAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkGoogleAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkGoogleAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkIOSDeviceIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkIOSDeviceIDRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DeviceID; // 0x10

    };

    struct FClientUnlinkKongregateAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkKongregateAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkNintendoServiceAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkNintendoServiceAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkNintendoSwitchDeviceIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkNintendoSwitchDeviceIdRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString NintendoSwitchDeviceId; // 0x10

    };

    struct FClientUnlinkOpenIdConnectRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkOpenIdConnectRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ConnectionId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FClientUnlinkPSNAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkPSNAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkSteamAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkSteamAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlinkTwitchAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkTwitchAccountRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AccessToken; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FClientUnlinkWindowsHelloAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkWindowsHelloAccountRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PublicKeyHint; // 0x10

    };

    struct FClientUnlinkXboxAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlinkXboxAccountRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FClientUnlockContainerInstanceRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlockContainerInstanceRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        struct FString ContainerItemInstanceId; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38
        struct FString KeyItemInstanceId; // 0x40

    };

    struct FClientUnlockContainerItemRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUnlockContainerItemRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        struct FString ContainerItemId; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38

    };

    struct FClientUpdateAvatarUrlRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdateAvatarUrlRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ImageUrl; // 0x8

    };

    struct FClientUpdateCharacterDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdateCharacterDataRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        class UPlayFabJsonObject* Data; // 0x20
        struct FString KeysToRemove; // 0x28
        enum class EUserDataPermission Permission; // 0x38

    };

    struct FClientUpdateCharacterStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdateCharacterStatisticsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* CharacterStatistics; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20

    };

    struct FClientUpdatePlayerStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdatePlayerStatisticsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct TArray<class UPlayFabJsonObject*> Statistics; // 0x10

    };

    struct FClientUpdateSharedGroupDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdateSharedGroupDataRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Data; // 0x10
        struct FString KeysToRemove; // 0x18
        enum class EUserDataPermission Permission; // 0x28
        struct FString SharedGroupId; // 0x30

    };

    struct FClientUpdateUserDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdateUserDataRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Data; // 0x10
        struct FString KeysToRemove; // 0x18
        enum class EUserDataPermission Permission; // 0x28

    };

    struct FClientUpdateUserTitleDisplayNameRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientUpdateUserTitleDisplayNameRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DisplayName; // 0x10

    };

    struct FClientValidateAmazonReceiptRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientValidateAmazonReceiptRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CurrencyCode; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        int32_t PurchasePrice; // 0x30
        struct FString ReceiptId; // 0x38
        struct FString UserId; // 0x48

    };

    struct FClientValidateGooglePlayPurchaseRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientValidateGooglePlayPurchaseRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CurrencyCode; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        int32_t PurchasePrice; // 0x30
        struct FString ReceiptJson; // 0x38
        struct FString Signature; // 0x48

    };

    struct FClientValidateIOSReceiptRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientValidateIOSReceiptRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CurrencyCode; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        int32_t PurchasePrice; // 0x30
        struct FString ReceiptData; // 0x38

    };

    struct FClientValidateWindowsReceiptRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientValidateWindowsReceiptRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CurrencyCode; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        int32_t PurchasePrice; // 0x30
        struct FString Receipt; // 0x38

    };

    struct FClientWriteClientCharacterEventRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientWriteClientCharacterEventRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* Body; // 0x8
        struct FString CharacterId; // 0x10
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString EventName; // 0x28
        struct FString Timestamp; // 0x38

    };

    struct FClientWriteClientPlayerEventRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientWriteClientPlayerEventRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* Body; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EventName; // 0x18
        struct FString Timestamp; // 0x28

    };

    struct FClientWriteTitleEventRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ClientWriteTitleEventRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* Body; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString EventName; // 0x18
        struct FString Timestamp; // 0x28

    };

    struct FCloudScriptExecuteCloudScriptResult : FPlayFabResultCommon //ScriptStruct PlayFab.CloudScriptExecuteCloudScriptResult
    {
    //Children Prop Count (Fields): 12
    public:

        int32_t APIRequestsIssued; // 0x8
        class UPlayFabJsonObject* Error; // 0x10
        int32_t ExecutionTimeSeconds; // 0x18
        struct FString FunctionName; // 0x20
        class UPlayFabJsonObject* FunctionResult; // 0x30
        bool FunctionResultTooLarge; // 0x38
        int32_t HttpRequestsIssued; // 0x3c
        struct TArray<class UPlayFabJsonObject*> Logs; // 0x40
        bool LogsTooLarge; // 0x50
        int32_t MemoryConsumedBytes; // 0x54
        int32_t ProcessorTimeSeconds; // 0x58
        int32_t Revision; // 0x5c

    };

    struct FCloudScriptExecuteFunctionResult : FPlayFabResultCommon //ScriptStruct PlayFab.CloudScriptExecuteFunctionResult
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* Error; // 0x8
        int32_t ExecutionTimeMilliseconds; // 0x10
        struct FString FunctionName; // 0x18
        class UPlayFabJsonObject* FunctionResult; // 0x28
        bool FunctionResultTooLarge; // 0x30

    };

    struct FCloudScriptListFunctionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.CloudScriptListFunctionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Functions; // 0x8

    };

    struct FCloudScriptListHttpFunctionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.CloudScriptListHttpFunctionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Functions; // 0x8

    };

    struct FCloudScriptListQueuedFunctionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.CloudScriptListQueuedFunctionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Functions; // 0x8

    };

    struct FCloudScriptEmptyResult : FPlayFabResultCommon //ScriptStruct PlayFab.CloudScriptEmptyResult
    {
    public:


    };

    struct FCloudScriptExecuteEntityCloudScriptRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptExecuteEntityCloudScriptRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString FunctionName; // 0x18
        class UPlayFabJsonObject* FunctionParameter; // 0x28
        bool GeneratePlayStreamEvent; // 0x30
        enum class ECloudScriptRevisionOption RevisionSelection; // 0x31
        int32_t SpecificRevision; // 0x34

    };

    struct FCloudScriptExecuteFunctionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptExecuteFunctionRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString FunctionName; // 0x18
        class UPlayFabJsonObject* FunctionParameter; // 0x28
        bool GeneratePlayStreamEvent; // 0x30

    };

    struct FCloudScriptListFunctionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptListFunctionsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FCloudScriptPostFunctionResultForEntityTriggeredActionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptPostFunctionResultForEntityTriggeredActionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* FunctionResult; // 0x18

    };

    struct FCloudScriptPostFunctionResultForFunctionExecutionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptPostFunctionResultForFunctionExecutionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* FunctionResult; // 0x18

    };

    struct FCloudScriptPostFunctionResultForPlayerTriggeredActionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptPostFunctionResultForPlayerTriggeredActionRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* FunctionResult; // 0x18
        class UPlayFabJsonObject* PlayerProfile; // 0x20
        class UPlayFabJsonObject* PlayStreamEventEnvelope; // 0x28

    };

    struct FCloudScriptPostFunctionResultForScheduledTaskRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptPostFunctionResultForScheduledTaskRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* FunctionResult; // 0x18
        class UPlayFabJsonObject* ScheduledTaskId; // 0x20

    };

    struct FCloudScriptRegisterHttpFunctionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptRegisterHttpFunctionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString FunctionName; // 0x10
        struct FString FunctionUrl; // 0x20

    };

    struct FCloudScriptRegisterQueuedFunctionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptRegisterQueuedFunctionRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString ConnectionString; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString FunctionName; // 0x20
        struct FString QueueName; // 0x30

    };

    struct FCloudScriptUnregisterFunctionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.CloudScriptUnregisterFunctionRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString FunctionName; // 0x10

    };

    struct FDataAbortFileUploadsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataAbortFileUploadsResponse
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        int32_t ProfileVersion; // 0x10

    };

    struct FDataAbortFileUploadsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataAbortFileUploadsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString FileNames; // 0x18
        int32_t ProfileVersion; // 0x28

    };

    struct FDataDeleteFilesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataDeleteFilesResponse
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        int32_t ProfileVersion; // 0x10

    };

    struct FDataFinalizeFileUploadsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataFinalizeFileUploadsResponse
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        class UPlayFabJsonObject* MetaData; // 0x10
        int32_t ProfileVersion; // 0x18

    };

    struct FDataGetFilesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataGetFilesResponse
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        class UPlayFabJsonObject* MetaData; // 0x10
        int32_t ProfileVersion; // 0x18

    };

    struct FDataGetObjectsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataGetObjectsResponse
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        class UPlayFabJsonObject* Objects; // 0x10
        int32_t ProfileVersion; // 0x18

    };

    struct FDataInitiateFileUploadsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataInitiateFileUploadsResponse
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        int32_t ProfileVersion; // 0x10
        struct TArray<class UPlayFabJsonObject*> UploadDetails; // 0x18

    };

    struct FDataSetObjectsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.DataSetObjectsResponse
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t ProfileVersion; // 0x8
        struct TArray<class UPlayFabJsonObject*> SetResults; // 0x10

    };

    struct FDataDeleteFilesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataDeleteFilesRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString FileNames; // 0x18
        int32_t ProfileVersion; // 0x28

    };

    struct FDataFinalizeFileUploadsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataFinalizeFileUploadsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString FileNames; // 0x18

    };

    struct FDataGetFilesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataGetFilesRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10

    };

    struct FDataGetObjectsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataGetObjectsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        bool EscapeObject; // 0x18

    };

    struct FDataInitiateFileUploadsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataInitiateFileUploadsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString FileNames; // 0x18
        int32_t ProfileVersion; // 0x28

    };

    struct FDataSetObjectsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.DataSetObjectsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        int32_t ExpectedProfileVersion; // 0x18
        struct TArray<class UPlayFabJsonObject*> Objects; // 0x20

    };

    struct FEventsWriteEventsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.EventsWriteEventsResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString AssignedEventIds; // 0x8

    };

    struct FEventsWriteEventsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.EventsWriteEventsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct TArray<class UPlayFabJsonObject*> Events; // 0x10

    };

    struct FExperimentationCreateExperimentResult : FPlayFabResultCommon //ScriptStruct PlayFab.ExperimentationCreateExperimentResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ExperimentId; // 0x8

    };

    struct FExperimentationCreateExperimentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationCreateExperimentRequest
    {
    //Children Prop Count (Fields): 9
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Description; // 0x10
        int32_t Duration; // 0x20
        enum class EExperimentType ExperimentType; // 0x24
        struct FString Name; // 0x28
        struct FString SegmentId; // 0x38
        struct FString StartDate; // 0x48
        struct FString TitlePlayerAccountTestIds; // 0x58
        struct TArray<class UPlayFabJsonObject*> Variants; // 0x68

    };

    struct FExperimentationEmptyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ExperimentationEmptyResponse
    {
    public:


    };

    struct FExperimentationGetExperimentsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ExperimentationGetExperimentsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Experiments; // 0x8

    };

    struct FExperimentationGetLatestScorecardResult : FPlayFabResultCommon //ScriptStruct PlayFab.ExperimentationGetLatestScorecardResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Scorecard; // 0x8

    };

    struct FExperimentationGetTreatmentAssignmentResult : FPlayFabResultCommon //ScriptStruct PlayFab.ExperimentationGetTreatmentAssignmentResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* TreatmentAssignment; // 0x8

    };

    struct FExperimentationDeleteExperimentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationDeleteExperimentRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ExperimentId; // 0x10

    };

    struct FExperimentationGetExperimentsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationGetExperimentsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FExperimentationGetLatestScorecardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationGetLatestScorecardRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ExperimentId; // 0x10

    };

    struct FExperimentationGetTreatmentAssignmentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationGetTreatmentAssignmentRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10

    };

    struct FExperimentationStartExperimentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationStartExperimentRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ExperimentId; // 0x10

    };

    struct FExperimentationStopExperimentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationStopExperimentRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ExperimentId; // 0x10

    };

    struct FExperimentationUpdateExperimentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ExperimentationUpdateExperimentRequest
    {
    //Children Prop Count (Fields): 10
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Description; // 0x10
        int32_t Duration; // 0x20
        enum class EExperimentType ExperimentType; // 0x24
        struct FString ID; // 0x28
        struct FString Name; // 0x38
        struct FString SegmentId; // 0x48
        struct FString StartDate; // 0x58
        struct FString TitlePlayerAccountTestIds; // 0x68
        struct TArray<class UPlayFabJsonObject*> Variants; // 0x78

    };

    struct FGroupsEmptyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsEmptyResponse
    {
    public:


    };

    struct FGroupsAcceptGroupApplicationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsAcceptGroupApplicationRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18

    };

    struct FGroupsAcceptGroupInvitationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsAcceptGroupInvitationRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18

    };

    struct FGroupsAddMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsAddMembersRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10
        struct TArray<class UPlayFabJsonObject*> Members; // 0x18
        struct FString RoleId; // 0x28

    };

    struct FGroupsApplyToGroupResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsApplyToGroupResponse
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Entity; // 0x8
        struct FString Expires; // 0x10
        class UPlayFabJsonObject* Group; // 0x20

    };

    struct FGroupsApplyToGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsApplyToGroupRequest
    {
    //Children Prop Count (Fields): 4
    public:

        bool AutoAcceptOutstandingInvite; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        class UPlayFabJsonObject* Entity; // 0x18
        class UPlayFabJsonObject* Group; // 0x20

    };

    struct FGroupsBlockEntityRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsBlockEntityRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18

    };

    struct FGroupsChangeMemberRoleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsChangeMemberRoleRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString DestinationRoleId; // 0x10
        class UPlayFabJsonObject* Group; // 0x20
        struct TArray<class UPlayFabJsonObject*> Members; // 0x28
        struct FString OriginRoleId; // 0x38

    };

    struct FGroupsCreateGroupResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsCreateGroupResponse
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString AdminRoleId; // 0x8
        struct FString Created; // 0x18
        class UPlayFabJsonObject* Group; // 0x28
        struct FString GroupName; // 0x30
        struct FString MemberRoleId; // 0x40
        int32_t ProfileVersion; // 0x50
        class UPlayFabJsonObject* Roles; // 0x58

    };

    struct FGroupsCreateGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsCreateGroupRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString GroupName; // 0x18

    };

    struct FGroupsCreateGroupRoleResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsCreateGroupRoleResponse
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t ProfileVersion; // 0x8
        struct FString RoleId; // 0x10
        struct FString RoleName; // 0x20

    };

    struct FGroupsCreateGroupRoleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsCreateGroupRoleRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10
        struct FString RoleId; // 0x18
        struct FString RoleName; // 0x28

    };

    struct FGroupsGetGroupResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsGetGroupResponse
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString AdminRoleId; // 0x8
        struct FString Created; // 0x18
        class UPlayFabJsonObject* Group; // 0x28
        struct FString GroupName; // 0x30
        struct FString MemberRoleId; // 0x40
        int32_t ProfileVersion; // 0x50
        class UPlayFabJsonObject* Roles; // 0x58

    };

    struct FGroupsInviteToGroupResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsInviteToGroupResponse
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString Expires; // 0x8
        class UPlayFabJsonObject* Group; // 0x18
        class UPlayFabJsonObject* InvitedByEntity; // 0x20
        class UPlayFabJsonObject* InvitedEntity; // 0x28
        struct FString RoleId; // 0x30

    };

    struct FGroupsIsMemberResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsIsMemberResponse
    {
    //Children Prop Count (Fields): 1
    public:

        bool IsMember; // 0x8

    };

    struct FGroupsListGroupApplicationsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsListGroupApplicationsResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Applications; // 0x8

    };

    struct FGroupsListGroupBlocksResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsListGroupBlocksResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BlockedEntities; // 0x8

    };

    struct FGroupsListGroupInvitationsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsListGroupInvitationsResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Invitations; // 0x8

    };

    struct FGroupsListGroupMembersResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsListGroupMembersResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Members; // 0x8

    };

    struct FGroupsListMembershipResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsListMembershipResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Groups; // 0x8

    };

    struct FGroupsListMembershipOpportunitiesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsListMembershipOpportunitiesResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<class UPlayFabJsonObject*> Applications; // 0x8
        struct TArray<class UPlayFabJsonObject*> Invitations; // 0x18

    };

    struct FGroupsUpdateGroupResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsUpdateGroupResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString OperationReason; // 0x8
        int32_t ProfileVersion; // 0x18
        enum class EOperationTypes SetResult; // 0x1c

    };

    struct FGroupsUpdateGroupRoleResponse : FPlayFabResultCommon //ScriptStruct PlayFab.GroupsUpdateGroupRoleResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString OperationReason; // 0x8
        int32_t ProfileVersion; // 0x18
        enum class EOperationTypes SetResult; // 0x1c

    };

    struct FGroupsDeleteGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsDeleteGroupRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10

    };

    struct FGroupsDeleteRoleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsDeleteRoleRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10
        struct FString RoleId; // 0x18

    };

    struct FGroupsGetGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsGetGroupRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10
        struct FString GroupName; // 0x18

    };

    struct FGroupsInviteToGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsInviteToGroupRequest
    {
    //Children Prop Count (Fields): 5
    public:

        bool AutoAcceptOutstandingApplication; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        class UPlayFabJsonObject* Entity; // 0x18
        class UPlayFabJsonObject* Group; // 0x20
        struct FString RoleId; // 0x28

    };

    struct FGroupsIsMemberRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsIsMemberRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18
        struct FString RoleId; // 0x20

    };

    struct FGroupsListGroupApplicationsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsListGroupApplicationsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10

    };

    struct FGroupsListGroupBlocksRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsListGroupBlocksRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10

    };

    struct FGroupsListGroupInvitationsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsListGroupInvitationsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10

    };

    struct FGroupsListGroupMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsListGroupMembersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10

    };

    struct FGroupsListMembershipRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsListMembershipRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10

    };

    struct FGroupsListMembershipOpportunitiesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsListMembershipOpportunitiesRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10

    };

    struct FGroupsRemoveGroupApplicationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsRemoveGroupApplicationRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18

    };

    struct FGroupsRemoveGroupInvitationRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsRemoveGroupInvitationRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18

    };

    struct FGroupsRemoveMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsRemoveMembersRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Group; // 0x10
        struct TArray<class UPlayFabJsonObject*> Members; // 0x18
        struct FString RoleId; // 0x28

    };

    struct FGroupsUnblockEntityRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsUnblockEntityRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        class UPlayFabJsonObject* Group; // 0x18

    };

    struct FGroupsUpdateGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsUpdateGroupRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString AdminRoleId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        int32_t ExpectedProfileVersion; // 0x20
        class UPlayFabJsonObject* Group; // 0x28
        struct FString GroupName; // 0x30
        struct FString MemberRoleId; // 0x40

    };

    struct FGroupsUpdateGroupRoleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.GroupsUpdateGroupRoleRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t ExpectedProfileVersion; // 0x10
        class UPlayFabJsonObject* Group; // 0x18
        struct FString RoleId; // 0x20
        struct FString RoleName; // 0x30

    };

    struct FInsightsInsightsGetDetailsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.InsightsInsightsGetDetailsResponse
    {
    //Children Prop Count (Fields): 6
    public:

        int32_t DataUsageMb; // 0x8
        struct FString errorMessage; // 0x10
        class UPlayFabJsonObject* Limits; // 0x20
        struct TArray<class UPlayFabJsonObject*> PendingOperations; // 0x28
        int32_t PerformanceLevel; // 0x38
        int32_t RetentionDays; // 0x3c

    };

    struct FInsightsInsightsGetLimitsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.InsightsInsightsGetLimitsResponse
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t DefaultPerformanceLevel; // 0x8
        int32_t DefaultStorageRetentionDays; // 0xc
        int32_t StorageMaxRetentionDays; // 0x10
        int32_t StorageMinRetentionDays; // 0x14
        struct TArray<class UPlayFabJsonObject*> SubMeters; // 0x18

    };

    struct FInsightsInsightsGetOperationStatusResponse : FPlayFabResultCommon //ScriptStruct PlayFab.InsightsInsightsGetOperationStatusResponse
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString Message; // 0x8
        struct FString OperationCompletedTime; // 0x18
        struct FString OperationId; // 0x28
        struct FString OperationLastUpdated; // 0x38
        struct FString OperationStartedTime; // 0x48
        struct FString OperationType; // 0x58
        int32_t OperationValue; // 0x68
        struct FString Status; // 0x70

    };

    struct FInsightsInsightsGetPendingOperationsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.InsightsInsightsGetPendingOperationsResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> PendingOperations; // 0x8

    };

    struct FInsightsInsightsOperationResponse : FPlayFabResultCommon //ScriptStruct PlayFab.InsightsInsightsOperationResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Message; // 0x8
        struct FString OperationId; // 0x18
        struct FString OperationType; // 0x28

    };

    struct FInsightsInsightsEmptyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.InsightsInsightsEmptyRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FInsightsInsightsGetOperationStatusRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.InsightsInsightsGetOperationStatusRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString OperationId; // 0x10

    };

    struct FInsightsInsightsGetPendingOperationsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.InsightsInsightsGetPendingOperationsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString OperationType; // 0x10

    };

    struct FInsightsInsightsSetPerformanceRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.InsightsInsightsSetPerformanceRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t PerformanceLevel; // 0x10

    };

    struct FInsightsInsightsSetStorageRetentionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.InsightsInsightsSetStorageRetentionRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t RetentionDays; // 0x10

    };

    struct FLocalizationGetLanguageListResponse : FPlayFabResultCommon //ScriptStruct PlayFab.LocalizationGetLanguageListResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString LanguageList; // 0x8

    };

    struct FLocalizationGetLanguageListRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.LocalizationGetLanguageListRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMatchmakerAuthUserResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MatchmakerAuthUserResponse
    {
    //Children Prop Count (Fields): 2
    public:

        bool Authorized; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FMatchmakerAuthUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MatchmakerAuthUserRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString AuthorizationTicket; // 0x8

    };

    struct FMatchmakerPlayerJoinedResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MatchmakerPlayerJoinedResponse
    {
    public:


    };

    struct FMatchmakerPlayerLeftResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MatchmakerPlayerLeftResponse
    {
    public:


    };

    struct FMatchmakerStartGameResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MatchmakerStartGameResponse
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString GameID; // 0x8
        struct FString ServerIPV4Address; // 0x18
        struct FString ServerIPV6Address; // 0x28
        int32_t ServerPort; // 0x38
        struct FString ServerPublicDNSName; // 0x40

    };

    struct FMatchmakerUserInfoResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MatchmakerUserInfoResponse
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<class UPlayFabJsonObject*> Inventory; // 0x8
        bool IsDeveloper; // 0x18
        struct FString PlayFabId; // 0x20
        struct FString SteamId; // 0x30
        struct FString TitleDisplayName; // 0x40
        struct FString Username; // 0x50
        class UPlayFabJsonObject* VirtualCurrency; // 0x60
        class UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x68

    };

    struct FMatchmakerPlayerJoinedRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MatchmakerPlayerJoinedRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString LobbyId; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FMatchmakerPlayerLeftRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MatchmakerPlayerLeftRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString LobbyId; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FMatchmakerStartGameRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MatchmakerStartGameRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString Build; // 0x8
        struct FString CustomCommandLineData; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString ExternalMatchmakerEventEndpoint; // 0x30
        struct FString GameMode; // 0x40
        enum class ERegion Region; // 0x50

    };

    struct FMatchmakerUserInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MatchmakerUserInfoRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t MinCatalogVersion; // 0x10
        struct FString PlayFabId; // 0x18

    };

    struct FMultiplayerCancelAllMatchmakingTicketsForPlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCancelAllMatchmakingTicketsForPlayerResult
    {
    public:


    };

    struct FMultiplayerCancelAllMatchmakingTicketsForPlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCancelAllMatchmakingTicketsForPlayerRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString QueueName; // 0x18

    };

    struct FMultiplayerCancelAllServerBackfillTicketsForPlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCancelAllServerBackfillTicketsForPlayerResult
    {
    public:


    };

    struct FMultiplayerCancelAllServerBackfillTicketsForPlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCancelAllServerBackfillTicketsForPlayerRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString QueueName; // 0x18

    };

    struct FMultiplayerCancelMatchmakingTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCancelMatchmakingTicketResult
    {
    public:


    };

    struct FMultiplayerCancelMatchmakingTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCancelMatchmakingTicketRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString QueueName; // 0x10
        struct FString TicketId; // 0x20

    };

    struct FMultiplayerCancelServerBackfillTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCancelServerBackfillTicketResult
    {
    public:


    };

    struct FMultiplayerCancelServerBackfillTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCancelServerBackfillTicketRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString QueueName; // 0x10
        struct FString TicketId; // 0x20

    };

    struct FMultiplayerBuildAliasDetailsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerBuildAliasDetailsResponse
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString AliasId; // 0x8
        struct FString AliasName; // 0x18
        struct TArray<class UPlayFabJsonObject*> BuildSelectionCriteria; // 0x28
        int32_t PageSize; // 0x38
        struct FString SkipToken; // 0x40

    };

    struct FMultiplayerCreateBuildAliasRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateBuildAliasRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AliasName; // 0x8
        struct TArray<class UPlayFabJsonObject*> BuildSelectionCriteria; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28

    };

    struct FMultiplayerCreateBuildWithCustomContainerResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCreateBuildWithCustomContainerResponse
    {
    //Children Prop Count (Fields): 18
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildId; // 0x10
        struct FString BuildName; // 0x20
        enum class EContainerFlavor ContainerFlavor; // 0x30
        struct FString ContainerRunCommand; // 0x38
        struct FString CreationTime; // 0x48
        class UPlayFabJsonObject* CustomGameContainerImage; // 0x58
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x60
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x70
        class UPlayFabJsonObject* LinuxInstrumentationConfiguration; // 0x80
        class UPlayFabJsonObject* MetaData; // 0x88
        int32_t MultiplayerServerCountPerVm; // 0x90
        struct FString OsPlatform; // 0x98
        struct TArray<class UPlayFabJsonObject*> Ports; // 0xa8
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0xb8
        struct FString ServerType; // 0xc8
        bool UseStreamingForAssetDownloads; // 0xd8
        enum class EAzureVmSize VmSize; // 0xd9

    };

    struct FMultiplayerCreateBuildWithCustomContainerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateBuildWithCustomContainerRequest
    {
    //Children Prop Count (Fields): 15
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildName; // 0x10
        enum class EContainerFlavor ContainerFlavor; // 0x20
        class UPlayFabJsonObject* ContainerImageReference; // 0x28
        struct FString ContainerRunCommand; // 0x30
        class UPlayFabJsonObject* CustomTags; // 0x40
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x48
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x58
        class UPlayFabJsonObject* LinuxInstrumentationConfiguration; // 0x68
        class UPlayFabJsonObject* MetaData; // 0x70
        int32_t MultiplayerServerCountPerVm; // 0x78
        struct TArray<class UPlayFabJsonObject*> Ports; // 0x80
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0x90
        bool UseStreamingForAssetDownloads; // 0xa0
        enum class EAzureVmSize VmSize; // 0xa1

    };

    struct FMultiplayerCreateBuildWithManagedContainerResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCreateBuildWithManagedContainerResponse
    {
    //Children Prop Count (Fields): 18
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildId; // 0x10
        struct FString BuildName; // 0x20
        enum class EContainerFlavor ContainerFlavor; // 0x30
        struct FString CreationTime; // 0x38
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x48
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x58
        struct FString GameWorkingDirectory; // 0x68
        class UPlayFabJsonObject* InstrumentationConfiguration; // 0x78
        class UPlayFabJsonObject* MetaData; // 0x80
        int32_t MultiplayerServerCountPerVm; // 0x88
        struct FString OsPlatform; // 0x90
        struct TArray<class UPlayFabJsonObject*> Ports; // 0xa0
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0xb0
        struct FString ServerType; // 0xc0
        struct FString StartMultiplayerServerCommand; // 0xd0
        bool UseStreamingForAssetDownloads; // 0xe0
        enum class EAzureVmSize VmSize; // 0xe1

    };

    struct FMultiplayerCreateBuildWithManagedContainerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateBuildWithManagedContainerRequest
    {
    //Children Prop Count (Fields): 15
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildName; // 0x10
        enum class EContainerFlavor ContainerFlavor; // 0x20
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x30
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x40
        struct FString GameWorkingDirectory; // 0x50
        class UPlayFabJsonObject* InstrumentationConfiguration; // 0x60
        class UPlayFabJsonObject* MetaData; // 0x68
        int32_t MultiplayerServerCountPerVm; // 0x70
        struct TArray<class UPlayFabJsonObject*> Ports; // 0x78
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0x88
        struct FString StartMultiplayerServerCommand; // 0x98
        bool UseStreamingForAssetDownloads; // 0xa8
        enum class EAzureVmSize VmSize; // 0xa9

    };

    struct FMultiplayerCreateBuildWithProcessBasedServerResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCreateBuildWithProcessBasedServerResponse
    {
    //Children Prop Count (Fields): 18
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildId; // 0x10
        struct FString BuildName; // 0x20
        enum class EContainerFlavor ContainerFlavor; // 0x30
        struct FString CreationTime; // 0x38
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x48
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x58
        struct FString GameWorkingDirectory; // 0x68
        class UPlayFabJsonObject* InstrumentationConfiguration; // 0x78
        class UPlayFabJsonObject* MetaData; // 0x80
        int32_t MultiplayerServerCountPerVm; // 0x88
        struct FString OsPlatform; // 0x90
        struct TArray<class UPlayFabJsonObject*> Ports; // 0xa0
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0xb0
        struct FString ServerType; // 0xc0
        struct FString StartMultiplayerServerCommand; // 0xd0
        bool UseStreamingForAssetDownloads; // 0xe0
        enum class EAzureVmSize VmSize; // 0xe1

    };

    struct FMultiplayerCreateBuildWithProcessBasedServerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateBuildWithProcessBasedServerRequest
    {
    //Children Prop Count (Fields): 15
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildName; // 0x10
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x28
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x38
        struct FString GameWorkingDirectory; // 0x48
        class UPlayFabJsonObject* InstrumentationConfiguration; // 0x58
        class UPlayFabJsonObject* MetaData; // 0x60
        int32_t MultiplayerServerCountPerVm; // 0x68
        struct FString OsPlatform; // 0x70
        struct TArray<class UPlayFabJsonObject*> Ports; // 0x80
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0x90
        struct FString StartMultiplayerServerCommand; // 0xa0
        bool UseStreamingForAssetDownloads; // 0xb0
        enum class EAzureVmSize VmSize; // 0xb1

    };

    struct FMultiplayerCreateMatchmakingTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCreateMatchmakingTicketResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TicketId; // 0x8

    };

    struct FMultiplayerCreateMatchmakingTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateMatchmakingTicketRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* Creator; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        int32_t GiveUpAfterSeconds; // 0x18
        struct TArray<class UPlayFabJsonObject*> MembersToMatchWith; // 0x20
        struct FString QueueName; // 0x30

    };

    struct FMultiplayerCreateRemoteUserResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCreateRemoteUserResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ExpirationTime; // 0x8
        struct FString Password; // 0x18
        struct FString Username; // 0x28

    };

    struct FMultiplayerCreateRemoteUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateRemoteUserRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString ExpirationTime; // 0x20
        struct FString Region; // 0x30
        struct FString Username; // 0x40
        struct FString VmId; // 0x50

    };

    struct FMultiplayerCreateServerBackfillTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerCreateServerBackfillTicketResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TicketId; // 0x8

    };

    struct FMultiplayerCreateServerBackfillTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateServerBackfillTicketRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t GiveUpAfterSeconds; // 0x10
        struct TArray<class UPlayFabJsonObject*> Members; // 0x18
        struct FString QueueName; // 0x28
        class UPlayFabJsonObject* ServerDetails; // 0x38

    };

    struct FMultiplayerCreateServerMatchmakingTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerCreateServerMatchmakingTicketRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t GiveUpAfterSeconds; // 0x10
        struct TArray<class UPlayFabJsonObject*> Members; // 0x18
        struct FString QueueName; // 0x28

    };

    struct FMultiplayerEmptyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerEmptyResponse
    {
    public:


    };

    struct FMultiplayerEnableMultiplayerServersForTitleResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerEnableMultiplayerServersForTitleResponse
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ETitleMultiplayerServerEnabledStatus Status; // 0x8

    };

    struct FMultiplayerGetAssetUploadUrlResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetAssetUploadUrlResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AssetUploadUrl; // 0x8
        struct FString Filename; // 0x18

    };

    struct FMultiplayerGetBuildResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetBuildResponse
    {
    //Children Prop Count (Fields): 20
    public:

        bool AreAssetsReadonly; // 0x8
        struct FString BuildId; // 0x10
        struct FString BuildName; // 0x20
        struct FString BuildStatus; // 0x30
        enum class EContainerFlavor ContainerFlavor; // 0x40
        struct FString ContainerRunCommand; // 0x48
        struct FString CreationTime; // 0x58
        class UPlayFabJsonObject* CustomGameContainerImage; // 0x68
        struct TArray<class UPlayFabJsonObject*> GameAssetReferences; // 0x70
        struct TArray<class UPlayFabJsonObject*> GameCertificateReferences; // 0x80
        class UPlayFabJsonObject* InstrumentationConfiguration; // 0x90
        class UPlayFabJsonObject* MetaData; // 0x98
        int32_t MultiplayerServerCountPerVm; // 0xa0
        struct FString OsPlatform; // 0xa8
        struct TArray<class UPlayFabJsonObject*> Ports; // 0xb8
        struct TArray<class UPlayFabJsonObject*> RegionConfigurations; // 0xc8
        struct FString ServerType; // 0xd8
        struct FString StartMultiplayerServerCommand; // 0xe8
        bool UseStreamingForAssetDownloads; // 0xf8
        enum class EAzureVmSize VmSize; // 0xf9

    };

    struct FMultiplayerGetContainerRegistryCredentialsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetContainerRegistryCredentialsResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString DnsName; // 0x8
        struct FString Password; // 0x18
        struct FString Username; // 0x28

    };

    struct FMultiplayerGetMatchResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetMatchResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString MatchID; // 0x8
        struct TArray<class UPlayFabJsonObject*> Members; // 0x18
        struct FString RegionPreferences; // 0x28
        class UPlayFabJsonObject* ServerDetails; // 0x38

    };

    struct FMultiplayerGetMatchmakingTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetMatchmakingTicketResult
    {
    //Children Prop Count (Fields): 10
    public:

        struct FString CancellationReasonString; // 0x8
        struct FString Created; // 0x18
        class UPlayFabJsonObject* Creator; // 0x28
        int32_t GiveUpAfterSeconds; // 0x30
        struct FString MatchID; // 0x38
        struct TArray<class UPlayFabJsonObject*> Members; // 0x48
        struct TArray<class UPlayFabJsonObject*> MembersToMatchWith; // 0x58
        struct FString QueueName; // 0x68
        struct FString Status; // 0x78
        struct FString TicketId; // 0x88

    };

    struct FMultiplayerGetMultiplayerServerDetailsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetMultiplayerServerDetailsResponse
    {
    //Children Prop Count (Fields): 10
    public:

        struct TArray<class UPlayFabJsonObject*> ConnectedPlayers; // 0x8
        struct FString FQDN; // 0x18
        struct FString IPV4Address; // 0x28
        struct FString LastStateTransitionTime; // 0x38
        struct TArray<class UPlayFabJsonObject*> Ports; // 0x48
        struct FString Region; // 0x58
        struct FString ServerId; // 0x68
        struct FString SessionId; // 0x78
        struct FString State; // 0x88
        struct FString VmId; // 0x98

    };

    struct FMultiplayerGetMultiplayerServerLogsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetMultiplayerServerLogsResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString LogDownloadUrl; // 0x8

    };

    struct FMultiplayerGetQueueStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetQueueStatisticsResult
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t NumberOfPlayersMatching; // 0x8
        class UPlayFabJsonObject* TimeToMatchStatisticsInSeconds; // 0x10

    };

    struct FMultiplayerGetRemoteLoginEndpointResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetRemoteLoginEndpointResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString IPV4Address; // 0x8
        int32_t Port; // 0x18

    };

    struct FMultiplayerGetServerBackfillTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetServerBackfillTicketResult
    {
    //Children Prop Count (Fields): 9
    public:

        struct FString CancellationReasonString; // 0x8
        struct FString Created; // 0x18
        int32_t GiveUpAfterSeconds; // 0x28
        struct FString MatchID; // 0x30
        struct TArray<class UPlayFabJsonObject*> Members; // 0x40
        struct FString QueueName; // 0x50
        class UPlayFabJsonObject* ServerDetails; // 0x60
        struct FString Status; // 0x68
        struct FString TicketId; // 0x78

    };

    struct FMultiplayerGetTitleEnabledForMultiplayerServersStatusResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetTitleEnabledForMultiplayerServersStatusResponse
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ETitleMultiplayerServerEnabledStatus Status; // 0x8

    };

    struct FMultiplayerGetTitleMultiplayerServersQuotasResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerGetTitleMultiplayerServersQuotasResponse
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Quotas; // 0x8

    };

    struct FMultiplayerJoinMatchmakingTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerJoinMatchmakingTicketResult
    {
    public:


    };

    struct FMultiplayerListMultiplayerServersResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListMultiplayerServersResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> MultiplayerServerSummaries; // 0x8
        int32_t PageSize; // 0x18
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListAssetSummariesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListAssetSummariesResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> AssetSummaries; // 0x8
        int32_t PageSize; // 0x18
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListBuildAliasesForTitleResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListBuildAliasesForTitleResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BuildAliases; // 0x8

    };

    struct FMultiplayerListBuildSummariesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListBuildSummariesResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> BuildSummaries; // 0x8
        int32_t PageSize; // 0x18
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListCertificateSummariesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListCertificateSummariesResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> CertificateSummaries; // 0x8
        int32_t PageSize; // 0x18
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListContainerImagesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListContainerImagesResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Images; // 0x8
        int32_t PageSize; // 0x18
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListContainerImageTagsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListContainerImageTagsResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Tags; // 0x8

    };

    struct FMultiplayerListMatchmakingTicketsForPlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListMatchmakingTicketsForPlayerResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TicketIds; // 0x8

    };

    struct FMultiplayerListPartyQosServersResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListPartyQosServersResponse
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t PageSize; // 0x8
        struct TArray<class UPlayFabJsonObject*> QosServers; // 0x10
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListQosServersForTitleResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListQosServersForTitleResponse
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t PageSize; // 0x8
        struct TArray<class UPlayFabJsonObject*> QosServers; // 0x10
        struct FString SkipToken; // 0x20

    };

    struct FMultiplayerListServerBackfillTicketsForPlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListServerBackfillTicketsForPlayerResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TicketIds; // 0x8

    };

    struct FMultiplayerListVirtualMachineSummariesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerListVirtualMachineSummariesResponse
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t PageSize; // 0x8
        struct FString SkipToken; // 0x10
        struct TArray<class UPlayFabJsonObject*> VirtualMachines; // 0x20

    };

    struct FMultiplayerRequestMultiplayerServerResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerRequestMultiplayerServerResponse
    {
    //Children Prop Count (Fields): 10
    public:

        struct TArray<class UPlayFabJsonObject*> ConnectedPlayers; // 0x8
        struct FString FQDN; // 0x18
        struct FString IPV4Address; // 0x28
        struct FString LastStateTransitionTime; // 0x38
        struct TArray<class UPlayFabJsonObject*> Ports; // 0x48
        struct FString Region; // 0x58
        struct FString ServerId; // 0x68
        struct FString SessionId; // 0x78
        struct FString State; // 0x88
        struct FString VmId; // 0x98

    };

    struct FMultiplayerRolloverContainerRegistryCredentialsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.MultiplayerRolloverContainerRegistryCredentialsResponse
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString DnsName; // 0x8
        struct FString Password; // 0x18
        struct FString Username; // 0x28

    };

    struct FMultiplayerDeleteAssetRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteAssetRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Filename; // 0x10

    };

    struct FMultiplayerDeleteBuildRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteBuildRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FMultiplayerDeleteBuildAliasRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteBuildAliasRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AliasId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FMultiplayerDeleteBuildRegionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteBuildRegionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Region; // 0x20

    };

    struct FMultiplayerDeleteCertificateRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteCertificateRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Name; // 0x10

    };

    struct FMultiplayerDeleteContainerImageRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteContainerImageRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ImageName; // 0x10

    };

    struct FMultiplayerDeleteRemoteUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerDeleteRemoteUserRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Region; // 0x20
        struct FString Username; // 0x30
        struct FString VmId; // 0x40

    };

    struct FMultiplayerEnableMultiplayerServersForTitleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerEnableMultiplayerServersForTitleRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerGetAssetUploadUrlRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetAssetUploadUrlRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Filename; // 0x10

    };

    struct FMultiplayerGetBuildRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetBuildRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FMultiplayerGetBuildAliasRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetBuildAliasRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AliasId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FMultiplayerGetContainerRegistryCredentialsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetContainerRegistryCredentialsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerGetMatchRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetMatchRequest
    {
    //Children Prop Count (Fields): 5
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool EscapeObject; // 0x10
        struct FString MatchID; // 0x18
        struct FString QueueName; // 0x28
        bool ReturnMemberAttributes; // 0x38

    };

    struct FMultiplayerGetMatchmakingTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetMatchmakingTicketRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool EscapeObject; // 0x10
        struct FString QueueName; // 0x18
        struct FString TicketId; // 0x28

    };

    struct FMultiplayerGetMultiplayerServerDetailsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetMultiplayerServerDetailsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Region; // 0x20
        struct FString SessionId; // 0x30

    };

    struct FMultiplayerGetMultiplayerServerLogsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetMultiplayerServerLogsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ServerId; // 0x10

    };

    struct FMultiplayerGetMultiplayerSessionLogsBySessionIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetMultiplayerSessionLogsBySessionIdRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString SessionId; // 0x10

    };

    struct FMultiplayerGetQueueStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetQueueStatisticsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString QueueName; // 0x10

    };

    struct FMultiplayerGetRemoteLoginEndpointRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetRemoteLoginEndpointRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Region; // 0x20
        struct FString VmId; // 0x30

    };

    struct FMultiplayerGetServerBackfillTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetServerBackfillTicketRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool EscapeObject; // 0x10
        struct FString QueueName; // 0x18
        struct FString TicketId; // 0x28

    };

    struct FMultiplayerGetTitleEnabledForMultiplayerServersStatusRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetTitleEnabledForMultiplayerServersStatusRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerGetTitleMultiplayerServersQuotasRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerGetTitleMultiplayerServersQuotasRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerJoinMatchmakingTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerJoinMatchmakingTicketRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Member; // 0x10
        struct FString QueueName; // 0x18
        struct FString TicketId; // 0x28

    };

    struct FMultiplayerListMultiplayerServersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListMultiplayerServersRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        int32_t PageSize; // 0x20
        struct FString Region; // 0x28
        struct FString SkipToken; // 0x38

    };

    struct FMultiplayerListAssetSummariesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListAssetSummariesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t PageSize; // 0x10
        struct FString SkipToken; // 0x18

    };

    struct FMultiplayerMultiplayerEmptyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerMultiplayerEmptyRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerListBuildSummariesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListBuildSummariesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t PageSize; // 0x10
        struct FString SkipToken; // 0x18

    };

    struct FMultiplayerListCertificateSummariesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListCertificateSummariesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t PageSize; // 0x10
        struct FString SkipToken; // 0x18

    };

    struct FMultiplayerListContainerImagesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListContainerImagesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t PageSize; // 0x10
        struct FString SkipToken; // 0x18

    };

    struct FMultiplayerListContainerImageTagsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListContainerImageTagsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ImageName; // 0x10

    };

    struct FMultiplayerListMatchmakingTicketsForPlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListMatchmakingTicketsForPlayerRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString QueueName; // 0x18

    };

    struct FMultiplayerListPartyQosServersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListPartyQosServersRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerListQosServersForTitleRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListQosServersForTitleRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool IncludeAllRegions; // 0x10

    };

    struct FMultiplayerListServerBackfillTicketsForPlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListServerBackfillTicketsForPlayerRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct FString QueueName; // 0x18

    };

    struct FMultiplayerListVirtualMachineSummariesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerListVirtualMachineSummariesRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        int32_t PageSize; // 0x20
        struct FString Region; // 0x28
        struct FString SkipToken; // 0x38

    };

    struct FMultiplayerRequestMultiplayerServerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerRequestMultiplayerServerRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* BuildAliasParams; // 0x8
        struct FString BuildId; // 0x10
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString InitialPlayers; // 0x28
        struct FString PreferredRegions; // 0x38
        struct FString SessionCookie; // 0x48
        struct FString SessionId; // 0x58

    };

    struct FMultiplayerRolloverContainerRegistryCredentialsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerRolloverContainerRegistryCredentialsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FMultiplayerShutdownMultiplayerServerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerShutdownMultiplayerServerRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString Region; // 0x20
        struct FString SessionId; // 0x30

    };

    struct FMultiplayerUntagContainerImageRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerUntagContainerImageRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ImageName; // 0x10
        struct FString Tag; // 0x20

    };

    struct FMultiplayerUpdateBuildAliasRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerUpdateBuildAliasRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString AliasId; // 0x8
        struct FString AliasName; // 0x18
        struct TArray<class UPlayFabJsonObject*> BuildSelectionCriteria; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38

    };

    struct FMultiplayerUpdateBuildRegionRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerUpdateBuildRegionRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString BuildId; // 0x8
        class UPlayFabJsonObject* BuildRegion; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20

    };

    struct FMultiplayerUpdateBuildRegionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerUpdateBuildRegionsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString BuildId; // 0x8
        struct TArray<class UPlayFabJsonObject*> BuildRegions; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28

    };

    struct FMultiplayerUploadCertificateRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.MultiplayerUploadCertificateRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* GameCertificate; // 0x10

    };

    struct FProfilesGetGlobalPolicyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesGetGlobalPolicyResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Permissions; // 0x8

    };

    struct FProfilesGetEntityProfileResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesGetEntityProfileResponse
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Profile; // 0x8

    };

    struct FProfilesGetEntityProfilesResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesGetEntityProfilesResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Profiles; // 0x8

    };

    struct FProfilesGetTitlePlayersFromMasterPlayerAccountIdsResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesGetTitlePlayersFromMasterPlayerAccountIdsResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString TitleId; // 0x8
        class UPlayFabJsonObject* TitlePlayerAccounts; // 0x18

    };

    struct FProfilesSetGlobalPolicyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesSetGlobalPolicyResponse
    {
    public:


    };

    struct FProfilesSetProfileLanguageResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesSetProfileLanguageResponse
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EOperationTypes OperationResult; // 0x8
        int32_t VersionNumber; // 0xc

    };

    struct FProfilesSetEntityProfilePolicyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ProfilesSetEntityProfilePolicyResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Permissions; // 0x8

    };

    struct FProfilesGetGlobalPolicyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesGetGlobalPolicyRequest
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8

    };

    struct FProfilesGetEntityProfileRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesGetEntityProfileRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool DataAsObject; // 0x10
        class UPlayFabJsonObject* Entity; // 0x18

    };

    struct FProfilesGetEntityProfilesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesGetEntityProfilesRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool DataAsObject; // 0x10
        struct TArray<class UPlayFabJsonObject*> Entities; // 0x18

    };

    struct FProfilesGetTitlePlayersFromMasterPlayerAccountIdsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesGetTitlePlayersFromMasterPlayerAccountIdsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString MasterPlayerAccountIds; // 0x10

    };

    struct FProfilesSetGlobalPolicyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesSetGlobalPolicyRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct TArray<class UPlayFabJsonObject*> Permissions; // 0x10

    };

    struct FProfilesSetProfileLanguageRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesSetProfileLanguageRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        int32_t ExpectedVersion; // 0x18
        struct FString Language; // 0x20

    };

    struct FProfilesSetEntityProfilePolicyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ProfilesSetEntityProfilePolicyRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* Entity; // 0x10
        struct TArray<class UPlayFabJsonObject*> Statements; // 0x18

    };

    struct FServerModifyCharacterVirtualCurrencyResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerModifyCharacterVirtualCurrencyResult
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Balance; // 0x8
        struct FString VirtualCurrency; // 0x10

    };

    struct FServerAddCharacterVirtualCurrencyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAddCharacterVirtualCurrencyRequest
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t Amount; // 0x8
        struct FString CharacterId; // 0x10
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString PlayFabId; // 0x28
        struct FString VirtualCurrency; // 0x38

    };

    struct FServerEmptyResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ServerEmptyResponse
    {
    public:


    };

    struct FServerAddFriendRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAddFriendRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString FriendEmail; // 0x8
        struct FString FriendPlayFabId; // 0x18
        struct FString FriendTitleDisplayName; // 0x28
        struct FString FriendUsername; // 0x38
        struct FString PlayFabId; // 0x48

    };

    struct FServerEmptyResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerEmptyResult
    {
    public:


    };

    struct FServerAddGenericIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAddGenericIDRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* GenericId; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FServerAddPlayerTagResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerAddPlayerTagResult
    {
    public:


    };

    struct FServerAddPlayerTagRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAddPlayerTagRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString TagName; // 0x20

    };

    struct FServerAddSharedGroupMembersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerAddSharedGroupMembersResult
    {
    public:


    };

    struct FServerAddSharedGroupMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAddSharedGroupMembersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabIds; // 0x8
        struct FString SharedGroupId; // 0x18

    };

    struct FServerModifyUserVirtualCurrencyResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerModifyUserVirtualCurrencyResult
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Balance; // 0x8
        int32_t BalanceChange; // 0xc
        struct FString PlayFabId; // 0x10
        struct FString VirtualCurrency; // 0x20

    };

    struct FServerAddUserVirtualCurrencyRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAddUserVirtualCurrencyRequest
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Amount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        struct FString PlayFabId; // 0x18
        struct FString VirtualCurrency; // 0x28

    };

    struct FServerAuthenticateSessionTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerAuthenticateSessionTicketResult
    {
    //Children Prop Count (Fields): 2
    public:

        bool IsSessionTicketExpired; // 0x8
        class UPlayFabJsonObject* UserInfo; // 0x10

    };

    struct FServerAuthenticateSessionTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAuthenticateSessionTicketRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SessionTicket; // 0x8

    };

    struct FServerAwardSteamAchievementResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerAwardSteamAchievementResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> AchievementResults; // 0x8

    };

    struct FServerAwardSteamAchievementRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerAwardSteamAchievementRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Achievements; // 0x8

    };

    struct FServerBanUsersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerBanUsersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FServerBanUsersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerBanUsersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<class UPlayFabJsonObject*> Bans; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18

    };

    struct FServerConsumeItemResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerConsumeItemResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ItemInstanceId; // 0x8
        int32_t RemainingUses; // 0x18

    };

    struct FServerConsumeItemRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerConsumeItemRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CharacterId; // 0x8
        int32_t ConsumeCount; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x20
        struct FString ItemInstanceId; // 0x28
        struct FString PlayFabId; // 0x38

    };

    struct FServerCreateSharedGroupResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerCreateSharedGroupResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SharedGroupId; // 0x8

    };

    struct FServerCreateSharedGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerCreateSharedGroupRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SharedGroupId; // 0x8

    };

    struct FServerDeleteCharacterFromUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerDeleteCharacterFromUserResult
    {
    public:


    };

    struct FServerDeletePlayerResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerDeletePlayerResult
    {
    public:


    };

    struct FServerDeletePushNotificationTemplateResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerDeletePushNotificationTemplateResult
    {
    public:


    };

    struct FServerDeregisterGameResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ServerDeregisterGameResponse
    {
    public:


    };

    struct FServerEvaluateRandomResultTableResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerEvaluateRandomResultTableResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ResultItemId; // 0x8

    };

    struct FServerExecuteCloudScriptResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerExecuteCloudScriptResult
    {
    //Children Prop Count (Fields): 12
    public:

        int32_t APIRequestsIssued; // 0x8
        class UPlayFabJsonObject* Error; // 0x10
        int32_t ExecutionTimeSeconds; // 0x18
        struct FString FunctionName; // 0x20
        class UPlayFabJsonObject* FunctionResult; // 0x30
        bool FunctionResultTooLarge; // 0x38
        int32_t HttpRequestsIssued; // 0x3c
        struct TArray<class UPlayFabJsonObject*> Logs; // 0x40
        bool LogsTooLarge; // 0x50
        int32_t MemoryConsumedBytes; // 0x54
        int32_t ProcessorTimeSeconds; // 0x58
        int32_t Revision; // 0x5c

    };

    struct FServerGetAllSegmentsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetAllSegmentsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Segments; // 0x8

    };

    struct FServerListUsersCharactersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerListUsersCharactersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Characters; // 0x8

    };

    struct FServerGetCatalogItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetCatalogItemsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Catalog; // 0x8

    };

    struct FServerGetCharacterDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetCharacterDataResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* Data; // 0x18
        int32_t DataVersion; // 0x20
        struct FString PlayFabId; // 0x28

    };

    struct FServerGetCharacterInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetCharacterInventoryResult
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CharacterId; // 0x8
        struct TArray<class UPlayFabJsonObject*> Inventory; // 0x18
        struct FString PlayFabId; // 0x28
        class UPlayFabJsonObject* VirtualCurrency; // 0x38
        class UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x40

    };

    struct FServerGetCharacterLeaderboardResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetCharacterLeaderboardResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8

    };

    struct FServerGetCharacterStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetCharacterStatisticsResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* CharacterStatistics; // 0x18
        struct FString PlayFabId; // 0x20

    };

    struct FServerGetContentDownloadUrlResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetContentDownloadUrlResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString URL; // 0x8

    };

    struct FServerGetLeaderboardResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetLeaderboardResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8
        struct FString NextReset; // 0x18
        int32_t Version; // 0x28

    };

    struct FServerGetFriendsListResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetFriendsListResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Friends; // 0x8

    };

    struct FServerGetLeaderboardAroundCharacterResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetLeaderboardAroundCharacterResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8

    };

    struct FServerGetLeaderboardAroundUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetLeaderboardAroundUserResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8
        struct FString NextReset; // 0x18
        int32_t Version; // 0x28

    };

    struct FServerGetLeaderboardForUsersCharactersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetLeaderboardForUsersCharactersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Leaderboard; // 0x8

    };

    struct FServerGetPlayerCombinedInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayerCombinedInfoResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* InfoResultPayload; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FServerGetPlayerProfileResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayerProfileResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* PlayerProfile; // 0x8

    };

    struct FServerGetPlayerSegmentsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayerSegmentsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Segments; // 0x8

    };

    struct FServerGetPlayersInSegmentResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayersInSegmentResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ContinuationToken; // 0x8
        struct TArray<class UPlayFabJsonObject*> PlayerProfiles; // 0x18
        int32_t ProfilesInSegment; // 0x28

    };

    struct FServerGetPlayerStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayerStatisticsResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabId; // 0x8
        struct TArray<class UPlayFabJsonObject*> Statistics; // 0x18

    };

    struct FServerGetPlayerStatisticVersionsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayerStatisticVersionsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> StatisticVersions; // 0x8

    };

    struct FServerGetPlayerTagsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayerTagsResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabId; // 0x8
        struct FString Tags; // 0x18

    };

    struct FServerGetPlayFabIDsFromFacebookIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromFacebookIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPlayFabIDsFromFacebookInstantGamesIdsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromFacebookInstantGamesIdsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPlayFabIDsFromGenericIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromGenericIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPlayFabIDsFromNintendoSwitchDeviceIdsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromNintendoSwitchDeviceIdsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPlayFabIDsFromPSNAccountIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromPSNAccountIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPlayFabIDsFromSteamIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromSteamIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPlayFabIDsFromXboxLiveIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromXboxLiveIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetPublisherDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetPublisherDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Data; // 0x8

    };

    struct FServerGetRandomResultTablesResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetRandomResultTablesResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Tables; // 0x8

    };

    struct FServerGetServerCustomIDsFromPlayFabIDsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetServerCustomIDsFromPlayFabIDsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Data; // 0x8

    };

    struct FServerGetSharedGroupDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetSharedGroupDataResult
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* Data; // 0x8
        struct FString Members; // 0x10

    };

    struct FServerGetStoreItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetStoreItemsResult
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* MarketingData; // 0x18
        enum class EPfSourceType Source; // 0x20
        struct TArray<class UPlayFabJsonObject*> Store; // 0x28
        struct FString StoreId; // 0x38

    };

    struct FServerGetTimeResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetTimeResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Time; // 0x8

    };

    struct FServerGetTitleDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetTitleDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* Data; // 0x8

    };

    struct FServerGetTitleNewsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetTitleNewsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> News; // 0x8

    };

    struct FServerGetUserAccountInfoResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetUserAccountInfoResult
    {
    //Children Prop Count (Fields): 1
    public:

        class UPlayFabJsonObject* UserInfo; // 0x8

    };

    struct FServerGetUserBansResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetUserBansResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FServerGetUserDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetUserDataResult
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* Data; // 0x8
        int32_t DataVersion; // 0x10
        struct FString PlayFabId; // 0x18

    };

    struct FServerGetUserInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGetUserInventoryResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<class UPlayFabJsonObject*> Inventory; // 0x8
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* VirtualCurrency; // 0x28
        class UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x30

    };

    struct FServerGrantCharacterToUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGrantCharacterToUserResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString CharacterId; // 0x8

    };

    struct FServerGrantItemsToCharacterResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGrantItemsToCharacterResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> ItemGrantResults; // 0x8

    };

    struct FServerGrantItemsToUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGrantItemsToUserResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> ItemGrantResults; // 0x8

    };

    struct FServerGrantItemsToUsersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerGrantItemsToUsersResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> ItemGrantResults; // 0x8

    };

    struct FServerLinkPSNAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerLinkPSNAccountResult
    {
    public:


    };

    struct FServerLinkServerCustomIdResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerLinkServerCustomIdResult
    {
    public:


    };

    struct FServerLinkXboxAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerLinkXboxAccountResult
    {
    public:


    };

    struct FServerServerLoginResult : FPlayFabLoginResultCommon //ScriptStruct PlayFab.ServerServerLoginResult
    {
    //Children Prop Count (Fields): 8
    public:

        class UPlayFabJsonObject* EntityToken; // 0x10
        class UPlayFabJsonObject* InfoResultPayload; // 0x18
        struct FString LastLoginTime; // 0x20
        bool NewlyCreated; // 0x30
        struct FString PlayFabId; // 0x38
        struct FString SessionTicket; // 0x48
        class UPlayFabJsonObject* SettingsForUser; // 0x58
        class UPlayFabJsonObject* TreatmentAssignment; // 0x60

    };

    struct FServerModifyItemUsesResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerModifyItemUsesResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ItemInstanceId; // 0x8
        int32_t RemainingUses; // 0x18

    };

    struct FServerMoveItemToCharacterFromCharacterResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerMoveItemToCharacterFromCharacterResult
    {
    public:


    };

    struct FServerMoveItemToCharacterFromUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerMoveItemToCharacterFromUserResult
    {
    public:


    };

    struct FServerMoveItemToUserFromCharacterResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerMoveItemToUserFromCharacterResult
    {
    public:


    };

    struct FServerNotifyMatchmakerPlayerLeftResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerNotifyMatchmakerPlayerLeftResult
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EPlayerConnectionState PlayerState; // 0x8

    };

    struct FServerRedeemCouponResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRedeemCouponResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> GrantedItems; // 0x8

    };

    struct FServerRedeemMatchmakerTicketResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRedeemMatchmakerTicketResult
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Error; // 0x8
        bool TicketIsValid; // 0x18
        class UPlayFabJsonObject* UserInfo; // 0x20

    };

    struct FServerRefreshGameServerInstanceHeartbeatResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRefreshGameServerInstanceHeartbeatResult
    {
    public:


    };

    struct FServerRegisterGameResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRegisterGameResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString LobbyId; // 0x8

    };

    struct FServerRemovePlayerTagResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRemovePlayerTagResult
    {
    public:


    };

    struct FServerRemoveSharedGroupMembersResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRemoveSharedGroupMembersResult
    {
    public:


    };

    struct FServerReportPlayerServerResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerReportPlayerServerResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t SubmissionsRemaining; // 0x8

    };

    struct FServerRevokeAllBansForUserResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRevokeAllBansForUserResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FServerRevokeBansResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRevokeBansResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FServerRevokeInventoryResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRevokeInventoryResult
    {
    public:


    };

    struct FServerRevokeInventoryItemsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerRevokeInventoryItemsResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> Errors; // 0x8

    };

    struct FServerSavePushNotificationTemplateResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSavePushNotificationTemplateResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PushNotificationTemplateId; // 0x8

    };

    struct FServerSendCustomAccountRecoveryEmailResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSendCustomAccountRecoveryEmailResult
    {
    public:


    };

    struct FServerSendEmailFromTemplateResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSendEmailFromTemplateResult
    {
    public:


    };

    struct FServerSendPushNotificationResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSendPushNotificationResult
    {
    public:


    };

    struct FServerSetGameServerInstanceDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSetGameServerInstanceDataResult
    {
    public:


    };

    struct FServerSetGameServerInstanceStateResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSetGameServerInstanceStateResult
    {
    public:


    };

    struct FServerSetGameServerInstanceTagsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSetGameServerInstanceTagsResult
    {
    public:


    };

    struct FServerSetPlayerSecretResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSetPlayerSecretResult
    {
    public:


    };

    struct FServerSetPublisherDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSetPublisherDataResult
    {
    public:


    };

    struct FServerSetTitleDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerSetTitleDataResult
    {
    public:


    };

    struct FServerUnlinkPSNAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUnlinkPSNAccountResult
    {
    public:


    };

    struct FServerUnlinkServerCustomIdResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUnlinkServerCustomIdResult
    {
    public:


    };

    struct FServerUnlinkXboxAccountResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUnlinkXboxAccountResult
    {
    public:


    };

    struct FServerUnlockContainerItemResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUnlockContainerItemResult
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<class UPlayFabJsonObject*> GrantedItems; // 0x8
        struct FString UnlockedItemInstanceId; // 0x18
        struct FString UnlockedWithItemInstanceId; // 0x28
        class UPlayFabJsonObject* VirtualCurrency; // 0x38

    };

    struct FServerUpdateBansResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUpdateBansResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> BanData; // 0x8

    };

    struct FServerUpdateCharacterDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUpdateCharacterDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t DataVersion; // 0x8

    };

    struct FServerUpdateCharacterStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUpdateCharacterStatisticsResult
    {
    public:


    };

    struct FServerUpdatePlayerStatisticsResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUpdatePlayerStatisticsResult
    {
    public:


    };

    struct FServerUpdateSharedGroupDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUpdateSharedGroupDataResult
    {
    public:


    };

    struct FServerUpdateUserDataResult : FPlayFabResultCommon //ScriptStruct PlayFab.ServerUpdateUserDataResult
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t DataVersion; // 0x8

    };

    struct FServerWriteEventResponse : FPlayFabResultCommon //ScriptStruct PlayFab.ServerWriteEventResponse
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString EventId; // 0x8

    };

    struct FServerDeleteCharacterFromUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerDeleteCharacterFromUserRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString PlayFabId; // 0x20
        bool SaveCharacterInventory; // 0x30

    };

    struct FServerDeletePlayerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerDeletePlayerRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FServerDeletePushNotificationTemplateRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerDeletePushNotificationTemplateRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PushNotificationTemplateId; // 0x8

    };

    struct FServerDeleteSharedGroupRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerDeleteSharedGroupRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SharedGroupId; // 0x8

    };

    struct FServerDeregisterGameRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerDeregisterGameRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString LobbyId; // 0x10

    };

    struct FServerEvaluateRandomResultTableRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerEvaluateRandomResultTableRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CatalogVersion; // 0x8
        struct FString TableId; // 0x18

    };

    struct FServerExecuteCloudScriptServerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerExecuteCloudScriptServerRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString FunctionName; // 0x10
        class UPlayFabJsonObject* FunctionParameter; // 0x20
        bool GeneratePlayStreamEvent; // 0x28
        struct FString PlayFabId; // 0x30
        enum class ECloudScriptRevisionOption RevisionSelection; // 0x40
        int32_t SpecificRevision; // 0x44

    };

    struct FServerGetAllSegmentsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetAllSegmentsRequest
    {
    public:


    };

    struct FServerListUsersCharactersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerListUsersCharactersRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FServerGetCatalogItemsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetCatalogItemsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString CatalogVersion; // 0x8

    };

    struct FServerGetCharacterDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetCharacterDataRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterId; // 0x8
        int32_t IfChangedFromDataVersion; // 0x18
        struct FString Keys; // 0x20
        struct FString PlayFabId; // 0x30

    };

    struct FServerGetCharacterInventoryRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetCharacterInventoryRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString PlayFabId; // 0x30

    };

    struct FServerGetCharacterLeaderboardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetCharacterLeaderboardRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterType; // 0x8
        int32_t MaxResultsCount; // 0x18
        int32_t StartPosition; // 0x1c
        struct FString StatisticName; // 0x20

    };

    struct FServerGetCharacterStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetCharacterStatisticsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CharacterId; // 0x8
        struct FString PlayFabId; // 0x18

    };

    struct FServerGetContentDownloadUrlRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetContentDownloadUrlRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString HttpMethod; // 0x8
        struct FString Key; // 0x18
        bool ThruCDN; // 0x28

    };

    struct FServerGetFriendLeaderboardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetFriendLeaderboardRequest
    {
    //Children Prop Count (Fields): 11
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool IncludeFacebookFriends; // 0x10
        bool IncludeSteamFriends; // 0x11
        int32_t MaxResultsCount; // 0x14
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* ProfileConstraints; // 0x28
        int32_t StartPosition; // 0x30
        struct FString StatisticName; // 0x38
        bool UseSpecificVersion; // 0x48
        int32_t Version; // 0x4c
        struct FString XboxToken; // 0x50

    };

    struct FServerGetFriendsListRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetFriendsListRequest
    {
    //Children Prop Count (Fields): 6
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool IncludeFacebookFriends; // 0x10
        bool IncludeSteamFriends; // 0x11
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* ProfileConstraints; // 0x28
        struct FString XboxToken; // 0x30

    };

    struct FServerGetLeaderboardRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetLeaderboardRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t MaxResultsCount; // 0x10
        class UPlayFabJsonObject* ProfileConstraints; // 0x18
        int32_t StartPosition; // 0x20
        struct FString StatisticName; // 0x28
        bool UseSpecificVersion; // 0x38
        int32_t Version; // 0x3c

    };

    struct FServerGetLeaderboardAroundCharacterRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetLeaderboardAroundCharacterRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CharacterId; // 0x8
        struct FString CharacterType; // 0x18
        int32_t MaxResultsCount; // 0x28
        struct FString PlayFabId; // 0x30
        struct FString StatisticName; // 0x40

    };

    struct FServerGetLeaderboardAroundUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetLeaderboardAroundUserRequest
    {
    //Children Prop Count (Fields): 7
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        int32_t MaxResultsCount; // 0x10
        struct FString PlayFabId; // 0x18
        class UPlayFabJsonObject* ProfileConstraints; // 0x28
        struct FString StatisticName; // 0x30
        bool UseSpecificVersion; // 0x40
        int32_t Version; // 0x44

    };

    struct FServerGetLeaderboardForUsersCharactersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetLeaderboardForUsersCharactersRequest
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t MaxResultsCount; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString StatisticName; // 0x20

    };

    struct FServerGetPlayerCombinedInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayerCombinedInfoRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        class UPlayFabJsonObject* InfoRequestParameters; // 0x10
        struct FString PlayFabId; // 0x18

    };

    struct FServerGetPlayerProfileRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayerProfileRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        class UPlayFabJsonObject* ProfileConstraints; // 0x20

    };

    struct FServerGetPlayersSegmentsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayersSegmentsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FServerGetPlayersInSegmentRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayersInSegmentRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString ContinuationToken; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        int32_t MaxBatchSize; // 0x20
        int32_t SecondsToLive; // 0x24
        struct FString SegmentId; // 0x28

    };

    struct FServerGetPlayerStatisticsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayerStatisticsRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString StatisticNames; // 0x20
        struct TArray<class UPlayFabJsonObject*> StatisticNameVersions; // 0x30

    };

    struct FServerGetPlayerStatisticVersionsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayerStatisticVersionsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString StatisticName; // 0x10

    };

    struct FServerGetPlayerTagsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayerTagsRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString Namespace; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FServerGetPlayFabIDsFromFacebookIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromFacebookIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FacebookIDs; // 0x8

    };

    struct FServerGetPlayFabIDsFromFacebookInstantGamesIdsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromFacebookInstantGamesIdsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FacebookInstantGamesIds; // 0x8

    };

    struct FServerGetPlayFabIDsFromGenericIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromGenericIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UPlayFabJsonObject*> GenericIDs; // 0x8

    };

    struct FServerGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString NintendoSwitchDeviceIds; // 0x8

    };

    struct FServerGetPlayFabIDsFromPSNAccountIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromPSNAccountIDsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t IssuerId; // 0x8
        struct FString PSNAccountIDs; // 0x10

    };

    struct FServerGetPlayFabIDsFromSteamIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromSteamIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString SteamStringIDs; // 0x8

    };

    struct FServerGetPlayFabIDsFromXboxLiveIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPlayFabIDsFromXboxLiveIDsRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Sandbox; // 0x8
        struct FString XboxLiveAccountIDs; // 0x18

    };

    struct FServerGetPublisherDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetPublisherDataRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Keys; // 0x8

    };

    struct FServerGetRandomResultTablesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetRandomResultTablesRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString CatalogVersion; // 0x8
        struct FString TableIDs; // 0x18

    };

    struct FServerGetServerCustomIDsFromPlayFabIDsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetServerCustomIDsFromPlayFabIDsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabIds; // 0x8

    };

    struct FServerGetSharedGroupDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetSharedGroupDataRequest
    {
    //Children Prop Count (Fields): 3
    public:

        bool GetMembers; // 0x8
        struct FString Keys; // 0x10
        struct FString SharedGroupId; // 0x20

    };

    struct FServerGetStoreItemsServerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetStoreItemsServerRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString PlayFabId; // 0x20
        struct FString StoreId; // 0x30

    };

    struct FServerGetTimeRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetTimeRequest
    {
    public:


    };

    struct FServerGetTitleDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetTitleDataRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Keys; // 0x8
        struct FString OverrideLabel; // 0x18

    };

    struct FServerGetTitleNewsRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetTitleNewsRequest
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Count; // 0x8

    };

    struct FServerGetUserAccountInfoRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetUserAccountInfoRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FServerGetUserBansRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetUserBansRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString PlayFabId; // 0x8

    };

    struct FServerGetUserDataRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetUserDataRequest
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t IfChangedFromDataVersion; // 0x8
        struct FString Keys; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FServerGetUserInventoryRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGetUserInventoryRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FServerGrantCharacterToUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGrantCharacterToUserRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString CharacterName; // 0x8
        struct FString CharacterType; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString PlayFabId; // 0x30

    };

    struct FServerGrantItemsToCharacterRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGrantItemsToCharacterRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString Annotation; // 0x8
        struct FString CatalogVersion; // 0x18
        struct FString CharacterId; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38
        struct FString ItemIds; // 0x40
        struct FString PlayFabId; // 0x50

    };

    struct FServerGrantItemsToUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGrantItemsToUserRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString Annotation; // 0x8
        struct FString CatalogVersion; // 0x18
        class UPlayFabJsonObject* CustomTags; // 0x28
        struct FString ItemIds; // 0x30
        struct FString PlayFabId; // 0x40

    };

    struct FServerGrantItemsToUsersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerGrantItemsToUsersRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CatalogVersion; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct TArray<class UPlayFabJsonObject*> ItemGrants; // 0x20

    };

    struct FServerLinkPSNAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerLinkPSNAccountRequest
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString AuthCode; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        bool ForceLink; // 0x20
        int32_t IssuerId; // 0x24
        struct FString PlayFabId; // 0x28
        struct FString RedirectUri; // 0x38

    };

    struct FServerLinkServerCustomIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerLinkServerCustomIdRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString PlayFabId; // 0x18
        struct FString ServerCustomId; // 0x28

    };

    struct FServerLinkXboxAccountRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerLinkXboxAccountRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        bool ForceLink; // 0x10
        struct FString PlayFabId; // 0x18
        struct FString XboxToken; // 0x28

    };

    struct FServerLoginWithServerCustomIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerLoginWithServerCustomIdRequest
    {
    //Children Prop Count (Fields): 5
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        class UPlayFabJsonObject* InfoRequestParameters; // 0x18
        struct FString PlayerSecret; // 0x20
        struct FString ServerCustomId; // 0x30

    };

    struct FServerLoginWithXboxRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerLoginWithXboxRequest
    {
    //Children Prop Count (Fields): 4
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        class UPlayFabJsonObject* InfoRequestParameters; // 0x18
        struct FString XboxToken; // 0x20

    };

    struct FServerLoginWithXboxIdRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerLoginWithXboxIdRequest
    {
    //Children Prop Count (Fields): 5
    public:

        bool CreateAccount; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x10
        class UPlayFabJsonObject* InfoRequestParameters; // 0x18
        struct FString Sandbox; // 0x20
        struct FString XboxId; // 0x30

    };

    struct FServerModifyItemUsesRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerModifyItemUsesRequest
    {
    //Children Prop Count (Fields): 4
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString ItemInstanceId; // 0x10
        struct FString PlayFabId; // 0x20
        int32_t UsesToAdd; // 0x30

    };

    struct FServerMoveItemToCharacterFromCharacterRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerMoveItemToCharacterFromCharacterRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString GivingCharacterId; // 0x8
        struct FString ItemInstanceId; // 0x18
        struct FString PlayFabId; // 0x28
        struct FString ReceivingCharacterId; // 0x38

    };

    struct FServerMoveItemToCharacterFromUserRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerMoveItemToCharacterFromUserRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        struct FString ItemInstanceId; // 0x18
        struct FString PlayFabId; // 0x28

    };

    struct FServerMoveItemToUserFromCharacterRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerMoveItemToUserFromCharacterRequest
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString CharacterId; // 0x8
        struct FString ItemInstanceId; // 0x18
        struct FString PlayFabId; // 0x28

    };

    struct FServerNotifyMatchmakerPlayerLeftRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerNotifyMatchmakerPlayerLeftRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString LobbyId; // 0x10
        struct FString PlayFabId; // 0x20

    };

    struct FServerRedeemCouponRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRedeemCouponRequest
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString CatalogVersion; // 0x8
        struct FString CharacterId; // 0x18
        struct FString CouponCode; // 0x28
        class UPlayFabJsonObject* CustomTags; // 0x38
        struct FString PlayFabId; // 0x40

    };

    struct FServerRedeemMatchmakerTicketRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRedeemMatchmakerTicketRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString LobbyId; // 0x10
        struct FString Ticket; // 0x20

    };

    struct FServerRefreshGameServerInstanceHeartbeatRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRefreshGameServerInstanceHeartbeatRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString LobbyId; // 0x8

    };

    struct FServerRegisterGameRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRegisterGameRequest
    {
    //Children Prop Count (Fields): 10
    public:

        struct FString Build; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
        struct FString GameMode; // 0x20
        struct FString LobbyId; // 0x30
        enum class ERegion Region; // 0x40
        struct FString ServerIPV4Address; // 0x48
        struct FString ServerIPV6Address; // 0x58
        struct FString ServerPort; // 0x68
        struct FString ServerPublicDNSName; // 0x78
        class UPlayFabJsonObject* Tags; // 0x88

    };

    struct FServerRemoveFriendRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRemoveFriendRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString FriendPlayFabId; // 0x8
        struct FString PlayFabId; // 0x18

    };

    struct FServerRemoveGenericIDRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRemoveGenericIDRequest
    {
    //Children Prop Count (Fields): 2
    public:

        class UPlayFabJsonObject* GenericId; // 0x8
        struct FString PlayFabId; // 0x10

    };

    struct FServerRemovePlayerTagRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRemovePlayerTagRequest
    {
    //Children Prop Count (Fields): 3
    public:

        class UPlayFabJsonObject* CustomTags; // 0x8
        struct FString PlayFabId; // 0x10
        struct FString TagName; // 0x20

    };

    struct FServerRemoveSharedGroupMembersRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerRemoveSharedGroupMembersRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PlayFabIds; // 0x8
        struct FString SharedGroupId; // 0x18

    };

    struct FServerReportPlayerServerRequest : FPlayFabRequestCommon //ScriptStruct PlayFab.ServerReportPlayerServerRequest
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString Comment; // 0x8
        class UPlayFabJsonObject* CustomTags; // 0x18
